// AnimBlueprintGeneratedClass ABP_LoadOutCharacter.ABP_LoadOutCharacter_C
// Size: 0x18a0 (Inherited: 0x2c0)
struct UABP_LoadOutCharacter_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2c8(0x158)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x420(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x440(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x468(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x4e8(0x80)
	char pad_568[0x8]; // 0x568(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0x570(0x1e0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x750(0x108)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x858(0xf0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x948(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xa08(0xc0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0xac8(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xbd0(0x20)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0xbf0(0x1e0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xdd0(0x80)
	struct FAnimNode_Root AnimGraphNode_Root; // 0xe50(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0xe80(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0xf88(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x1090(0x108)
	struct FAnimNode_LegIK AnimGraphNode_LegIK_2; // 0x1198(0xf8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x1290(0x108)
	struct FAnimNode_LegIK AnimGraphNode_LegIK; // 0x1398(0xf8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1490(0x108)
	struct UAnimSequenceBase* BasePose_AS; // 0x1598(0x08)
	struct FVector LeftHandIK_Pos; // 0x15a0(0x0c)
	struct FRotator LeftHandIK_Rot; // 0x15ac(0x0c)
	float LeftHandIKBlend; // 0x15b8(0x04)
	char pad_15BC[0x4]; // 0x15bc(0x04)
	struct AHWWeapon* CurrentWeapon; // 0x15c0(0x08)
	struct FName ArmorId; // 0x15c8(0x08)
	struct FName CharacterId; // 0x15d0(0x08)
	enum class ELoadoutCharacterPoseType CharacterView; // 0x15d8(0x01)
	char pad_15D9[0x3]; // 0x15d9(0x03)
	struct FVector PoleLPos; // 0x15dc(0x0c)
	struct ABP_LoadOutCharacter_C* LoadOutChar_ref; // 0x15e8(0x08)
	struct UAnimSequence* FingerposeL; // 0x15f0(0x08)
	struct UAnimSequence* FingerposeR; // 0x15f8(0x08)
	struct UAnimSequenceBase* HUB_ME_RifleBase; // 0x1600(0x08)
	struct UAnimSequenceBase* HUB_ME_PistolBase; // 0x1608(0x08)
	struct FVector RightHandIK_Pos; // 0x1610(0x0c)
	struct FVector PoleRPos; // 0x161c(0x0c)
	struct UAnimSequenceBase* HUB_FarCenter; // 0x1628(0x08)
	struct UAnimSequenceBase* HUB_Right; // 0x1630(0x08)
	struct UAnimSequenceBase* LoadoutME_PistolBase; // 0x1638(0x08)
	struct UAnimSequenceBase* LoadoutME_RifleBase; // 0x1640(0x08)
	struct UAnimSequenceBase* PrematchME_Pistol; // 0x1648(0x08)
	struct UAnimSequenceBase* PrematchME_Rifle; // 0x1650(0x08)
	struct FVector IK_HAND_GUN_OFFS_pos_STATIC; // 0x1658(0x0c)
	struct FRotator IK_HAND_GUN_OFFS_rot_STATIC; // 0x1664(0x0c)
	float UseFingerAnimL; // 0x1670(0x04)
	bool UseLeftHandIK; // 0x1674(0x01)
	bool HasWeapon; // 0x1675(0x01)
	char pad_1676[0x2]; // 0x1676(0x02)
	float RightHandIKBlend; // 0x1678(0x04)
	float UseFingerAnimR; // 0x167c(0x04)
	float tmp_cellvisibility; // 0x1680(0x04)
	bool UsesDebugCharacter; // 0x1684(0x01)
	char pad_1685[0x3]; // 0x1685(0x03)
	struct ABP_LoadoutCharacterDebug_C* LoadoutCharacterDebug_ref; // 0x1688(0x08)
	struct UAnimSequenceBase* LoadoutME_NoWeapon; // 0x1690(0x08)
	struct UAnimSequenceBase* VictoryME_PistolBase; // 0x1698(0x08)
	struct UAnimSequenceBase* VictoryME_RifleBase; // 0x16a0(0x08)
	struct UAnimSequenceBase* VictoryME_AxeBase; // 0x16a8(0x08)
	struct UAnimSequenceBase* LoadoutME_AxeBase; // 0x16b0(0x08)
	struct UAnimSequenceBase* PrematchME_Axe; // 0x16b8(0x08)
	struct UAnimSequenceBase* PrematchLEFT_Pistol; // 0x16c0(0x08)
	struct UAnimSequenceBase* PrematchLEFT_Rifle; // 0x16c8(0x08)
	struct UAnimSequenceBase* PrematchLEFT_Axe; // 0x16d0(0x08)
	struct UAnimSequenceBase* PrematchRIGHT_Pistol; // 0x16d8(0x08)
	struct UAnimSequenceBase* PrematchRIGHT_Rifle; // 0x16e0(0x08)
	struct UAnimSequenceBase* PrematchRIGHT_Axe; // 0x16e8(0x08)
	struct UAnimSequenceBase* VictoryLEFT_PistolBase; // 0x16f0(0x08)
	struct UAnimSequenceBase* VictoryLEFT_RifleBase; // 0x16f8(0x08)
	struct UAnimSequenceBase* VictoryLEFT_AxeBase; // 0x1700(0x08)
	struct UAnimSequenceBase* VictoryRIGHT_PistolBase; // 0x1708(0x08)
	struct UAnimSequenceBase* VictoryRIGHT_RifleBase; // 0x1710(0x08)
	struct UAnimSequenceBase* VictoryRIGHT_AxeBase; // 0x1718(0x08)
	struct USkeletalMeshComponent* Face_ref; // 0x1720(0x08)
	struct FTimerHandle TimedBlinkEvent_Handle; // 0x1728(0x08)
	float TimedBlinkCooldown; // 0x1730(0x04)
	float BlinkTarget; // 0x1734(0x04)
	float BlinkBlend; // 0x1738(0x04)
	bool IsInBlink; // 0x173c(0x01)
	char pad_173D[0x3]; // 0x173d(0x03)
	float look_left; // 0x1740(0x04)
	float look_right; // 0x1744(0x04)
	float look_up; // 0x1748(0x04)
	float look_down; // 0x174c(0x04)
	float EyeDirCooldown; // 0x1750(0x04)
	char pad_1754[0x4]; // 0x1754(0x04)
	struct FTimerHandle EyeDirectionTimerEvent_Handle; // 0x1758(0x08)
	float LookLeftLerped; // 0x1760(0x04)
	float LookRightLerped; // 0x1764(0x04)
	float LookUpLerped; // 0x1768(0x04)
	float LookDownLerped; // 0x176c(0x04)
	struct FRotator HeadTurnAngle_target; // 0x1770(0x0c)
	struct FRotator NeckTurnAngle_target; // 0x177c(0x0c)
	float HeadTurnCooldown; // 0x1788(0x04)
	char pad_178C[0x4]; // 0x178c(0x04)
	struct UCurveVector* HeadRotations; // 0x1790(0x08)
	struct FRotator HeadTurnAngle; // 0x1798(0x0c)
	struct FRotator NeckTurnAngle; // 0x17a4(0x0c)
	float HeadTurnSpeed; // 0x17b0(0x04)
	float NeckTurnSpeed; // 0x17b4(0x04)
	struct FRotator SpineTurnAngle_target; // 0x17b8(0x0c)
	struct FRotator SpineTurnAngle; // 0x17c4(0x0c)
	struct FVector IK_HAND_GUN_OFFS_pos; // 0x17d0(0x0c)
	struct FRotator IK_HAND_GUN_OFFS_rot; // 0x17dc(0x0c)
	float SpineTurnMult; // 0x17e8(0x04)
	float HeadTurnGlobalMultiplier; // 0x17ec(0x04)
	struct FTimerHandle HeadTurnerEvent_Handle; // 0x17f0(0x08)
	struct FVector HipsPosOffs; // 0x17f8(0x0c)
	float Breathing01; // 0x1804(0x04)
	struct FRotator BreathSpine01; // 0x1808(0x0c)
	float Breathing02; // 0x1814(0x04)
	struct FRotator BreathSpine02; // 0x1818(0x0c)
	struct FRotator SpineTurnAngle02; // 0x1824(0x0c)
	struct UAnimSequenceBase* LoserME_PistolBase; // 0x1830(0x08)
	struct UAnimSequenceBase* LoserME_RifleBase; // 0x1838(0x08)
	struct UAnimSequenceBase* LoserME_AxeBase; // 0x1840(0x08)
	struct UAnimSequenceBase* LoserLEFT_PistolBase; // 0x1848(0x08)
	struct UAnimSequenceBase* LoserLEFT_RifleBase; // 0x1850(0x08)
	struct UAnimSequenceBase* LoserLEFT_AxeBase; // 0x1858(0x08)
	struct UAnimSequenceBase* LoserRIGHT_PistolBase; // 0x1860(0x08)
	struct UAnimSequenceBase* LoserRIGHT_RifleBase; // 0x1868(0x08)
	struct UAnimSequenceBase* LoserRIGHT_AxeBase; // 0x1870(0x08)
	struct FRotator HACK_HandRRotationOffset; // 0x1878(0x0c)
	char pad_1884[0x4]; // 0x1884(0x04)
	struct USkeletalMeshComponent* FacialHair_Ref; // 0x1888(0x08)
	struct AHWWeaponPart* PreviousPart; // 0x1890(0x08)
	struct AHWWeaponPart* NewPart; // 0x1898(0x08)

	void AnimGraph(struct FPoseLink AnimGraph); // Function ABP_LoadOutCharacter.ABP_LoadOutCharacter_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void SetBackPackVisibility(bool bNewVisibility); // Function ABP_LoadOutCharacter.ABP_LoadOutCharacter_C.SetBackPackVisibility // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void PrintSocketError(struct UObject* Object, struct FName InName, struct UStaticMeshComponent* Mesh); // Function ABP_LoadOutCharacter.ABP_LoadOutCharacter_C.PrintSocketError // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	struct FName GetSocketNameFromCurveValue(); // Function ABP_LoadOutCharacter.ABP_LoadOutCharacter_C.GetSocketNameFromCurveValue // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x13c4ca0
	void PoseSelectorFromWeapon(struct UAnimSequenceBase* Axe, struct UAnimSequenceBase* Pistol, struct UAnimSequenceBase* Rifle, struct UAnimSequenceBase* NoWeapon, struct UAnimSequenceBase* OutPose); // Function ABP_LoadOutCharacter.ABP_LoadOutCharacter_C.PoseSelectorFromWeapon // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void Get Weapon Type For Loadout Anims(struct AHWWeapon* Weapon, enum class EHWWeaponType Result); // Function ABP_LoadOutCharacter.ABP_LoadOutCharacter_C.Get Weapon Type For Loadout Anims // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x13c4ca0
	void Loadout Screen Setters(); // Function ABP_LoadOutCharacter.ABP_LoadOutCharacter_C.Loadout Screen Setters // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	struct FVector GetAnimationCurveValues(struct FName curveX, struct FName curveY, struct FName curveZ); // Function ABP_LoadOutCharacter.ABP_LoadOutCharacter_C.GetAnimationCurveValues // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x13c4ca0
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_LoadOutCharacter.ABP_LoadOutCharacter_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x13c4ca0
	void BlueprintInitializeAnimation(); // Function ABP_LoadOutCharacter.ABP_LoadOutCharacter_C.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // @ game+0x13c4ca0
	void RefreshPose(); // Function ABP_LoadOutCharacter.ABP_LoadOutCharacter_C.RefreshPose // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void OnLoadoutChanged_Event_1(struct ABP_LoadOutCharacter_C* LoadoutCharacter); // Function ABP_LoadOutCharacter.ABP_LoadOutCharacter_C.OnLoadoutChanged_Event_1 // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void EyeDirectionTimed_Event(); // Function ABP_LoadOutCharacter.ABP_LoadOutCharacter_C.EyeDirectionTimed_Event // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void EyeDirection_Event(); // Function ABP_LoadOutCharacter.ABP_LoadOutCharacter_C.EyeDirection_Event // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void BlinkTargetReturn(); // Function ABP_LoadOutCharacter.ABP_LoadOutCharacter_C.BlinkTargetReturn // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void TimedBlink_Event(); // Function ABP_LoadOutCharacter.ABP_LoadOutCharacter_C.TimedBlink_Event // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void EyesBlink_Event(); // Function ABP_LoadOutCharacter.ABP_LoadOutCharacter_C.EyesBlink_Event // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void HeadTurnTimed_Event(); // Function ABP_LoadOutCharacter.ABP_LoadOutCharacter_C.HeadTurnTimed_Event // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void HeadTurner_Event(float GlobalMultiplier); // Function ABP_LoadOutCharacter.ABP_LoadOutCharacter_C.HeadTurner_Event // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void ExecuteUbergraph_ABP_LoadOutCharacter(int32_t EntryPoint); // Function ABP_LoadOutCharacter.ABP_LoadOutCharacter_C.ExecuteUbergraph_ABP_LoadOutCharacter // (Final|UbergraphFunction|HasDefaults) // @ game+0x13c4ca0
};

