// AnimBlueprintGeneratedClass ABP_Player_1p.ABP_Player_1p_C
// Size: 0x5248 (Inherited: 0x2c0)
struct UABP_Player_1p_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8; // 0x2c8(0x20)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0x2e8(0xc0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8; // 0x3a8(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_14; // 0x3c8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_13; // 0x4d0(0x108)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x5d8(0x50)
	char pad_628[0x8]; // 0x628(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_5; // 0x630(0x1e0)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_4; // 0x810(0x1e0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x9f0(0x50)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12; // 0xa40(0x108)
	struct FAnimNode_Root AnimGraphNode_Root_5; // 0xb48(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3; // 0xb78(0x118)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0xc90(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0xcb8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0xce0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0xd08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0xd30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0xd58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0xd80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0xda8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0xdd0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0xe50(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0xe80(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0xf00(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0xf30(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0xfb0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0xfe0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x1060(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x1090(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x1110(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x1140(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x11c0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x11f0(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x12a0(0xa0)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_3; // 0x1340(0x1e0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11; // 0x1520(0x108)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1628(0xf0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7; // 0x1718(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7; // 0x1738(0x20)
	struct FAnimNode_Slot AnimGraphNode_Slot_10; // 0x1758(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_9; // 0x17a0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_8; // 0x17e8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0x1830(0x48)
	struct FAnimNode_Root AnimGraphNode_Root_4; // 0x1878(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2; // 0x18a8(0x118)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6; // 0x19c0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10; // 0x19e0(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6; // 0x1ae8(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_3; // 0x1b08(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x1b38(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x1bd8(0x80)
	struct FAnimNode_Root AnimGraphNode_Root_2; // 0x1c58(0x30)
	char pad_1C88[0x8]; // 0x1c88(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0x1c90(0x1e0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0x1e70(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9; // 0x1e90(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0x1f98(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x1fb8(0x158)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8; // 0x2110(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x2218(0x108)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x2320(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x2368(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0x24c0(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x24e8(0xa0)
	char pad_2588[0x8]; // 0x2588(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x2590(0x1e0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_4; // 0x2770(0xb0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x2820(0x108)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x2928(0x158)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x2a80(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0x2aa0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0x2ac8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x2af0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x2c48(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x2c70(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x2c98(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x2cb8(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x2ce0(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x2de8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x2e08(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x2e28(0x80)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x2ea8(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x2ec8(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x2f68(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x3070(0x80)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x30f0(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3138(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x3158(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x3178(0x108)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x3280(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x33d8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x3400(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x3428(0xc0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x34e8(0x20)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x3508(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x35c8(0x80)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x3648(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x37a0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x37c8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x37f0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x3948(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x3970(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3998(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x3a38(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x3a80(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x3aa8(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x3b68(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x3cc0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x3ce8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x3d10(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x3dd0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x3e18(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x3e60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x3e88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x3eb0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3ed8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x3f00(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x3f80(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x3fb0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x4030(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x4060(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x40e0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4110(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4190(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x41c0(0xb0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x4270(0x108)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0x4378(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0x4440(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x4508(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x45d0(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x4698(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x46e0(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x47a0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x48f8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4920(0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_3; // 0x4948(0xb0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x49f8(0x108)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_2; // 0x4b00(0xb0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x4bb0(0xb0)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x4c60(0x118)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x4d78(0x30)
	bool IsMoving; // 0x4da8(0x01)
	bool IsAiming; // 0x4da9(0x01)
	char pad_4DAA[0x2]; // 0x4daa(0x02)
	struct FVector Velocity; // 0x4dac(0x0c)
	struct FVector IK_AimOffset; // 0x4db8(0x0c)
	float WeaponDepthFromCam; // 0x4dc4(0x04)
	struct FVector LeftHandIKPositionHandRSpace; // 0x4dc8(0x0c)
	struct FRotator LeftHandIKRotationHanRSpace; // 0x4dd4(0x0c)
	struct FTransform FPCameraTransformRootSpace; // 0x4de0(0x30)
	float AimRootDistanceFromAimPoint; // 0x4e10(0x04)
	bool isFiring; // 0x4e14(0x01)
	char pad_4E15[0x3]; // 0x4e15(0x03)
	struct FVector SimpleRecoilOffset; // 0x4e18(0x0c)
	float LookUDRate_Raw; // 0x4e24(0x04)
	float LookLRRate_Raw; // 0x4e28(0x04)
	float LookUDRate_Lerped; // 0x4e2c(0x04)
	float LookLRRate_Lerped; // 0x4e30(0x04)
	float LeadingSpeedH; // 0x4e34(0x04)
	float LeadingSpeedV; // 0x4e38(0x04)
	float LeadingRollRate_Lerped; // 0x4e3c(0x04)
	float RightAxisValue_Raw; // 0x4e40(0x04)
	float LeadingSpeedRoll; // 0x4e44(0x04)
	struct FRotator SimpleRecoilKickRotOffset; // 0x4e48(0x0c)
	struct FVector SimpleRecoilKickVector; // 0x4e54(0x0c)
	float CurrentWeaponAimspeedBlend; // 0x4e60(0x04)
	float LeanRotation; // 0x4e64(0x04)
	float WeaponDepthFromCam_Actual; // 0x4e68(0x04)
	struct FRotator AimHandRotation; // 0x4e6c(0x0c)
	float IsWalking_Blend; // 0x4e78(0x04)
	float IsRunning_Blend; // 0x4e7c(0x04)
	bool IsJog; // 0x4e80(0x01)
	bool Activate; // 0x4e81(0x01)
	char pad_4E82[0x2]; // 0x4e82(0x02)
	float WALKRUN_INTERPSPEED; // 0x4e84(0x04)
	bool IsCurrentWeaponAutomatic; // 0x4e88(0x01)
	enum class EHWWeaponType CurrentWeaponType; // 0x4e89(0x01)
	bool ClimbingLadder; // 0x4e8a(0x01)
	char pad_4E8B[0x1]; // 0x4e8b(0x01)
	float UseWristSkinningFix; // 0x4e8c(0x04)
	enum class ALS_Stance ALS_Stance; // 0x4e90(0x01)
	enum class ALS_Gait ALS_Gait; // 0x4e91(0x01)
	char pad_4E92[0x6]; // 0x4e92(0x06)
	struct ABP_PlayerCharacter_Anim_C* PlayerCharacterAnim_ref; // 0x4e98(0x08)
	struct FVector FPCameraPOSRootSpace; // 0x4ea0(0x0c)
	struct FRotator FPCameraROTRootSpace; // 0x4eac(0x0c)
	struct FVector FaPa_Recoils; // 0x4eb8(0x0c)
	struct FRotator Fapa_RecoilROT; // 0x4ec4(0x0c)
	struct FRotator FaPo_LeadingROT; // 0x4ed0(0x0c)
	struct FRotator FaPa_HipFireLean; // 0x4edc(0x0c)
	struct AHWWeaponPart* PartWithLhandsocket; // 0x4ee8(0x08)
	bool hackForSMGelbowFlipping; // 0x4ef0(0x01)
	char pad_4EF1[0x3]; // 0x4ef1(0x03)
	struct FVector TickedLeftHandSocketPos_Gunspace; // 0x4ef4(0x0c)
	struct FRotator TickedLHandSocketPosRootSpace; // 0x4f00(0x0c)
	float RunAnimSpeedMult; // 0x4f0c(0x04)
	float SprintAnimSpeedMult; // 0x4f10(0x04)
	bool IsFiringNewHack; // 0x4f14(0x01)
	bool IsHipfiring; // 0x4f15(0x01)
	char pad_4F16[0x2]; // 0x4f16(0x02)
	struct FVector newOFFSET; // 0x4f18(0x0c)
	struct FVector IKHandGun_Location; // 0x4f24(0x0c)
	struct FVector Spine02_Location; // 0x4f30(0x0c)
	struct FVector IkHandLJointTarget_Location; // 0x4f3c(0x0c)
	struct FVector IkHandRJointTarget_Location; // 0x4f48(0x0c)
	struct FVector IKHandRoot_Location; // 0x4f54(0x0c)
	struct FRotator WristRotator; // 0x4f60(0x0c)
	enum class EHW_AnimationWeaponType AnimationWeaponType; // 0x4f6c(0x01)
	char pad_4F6D[0x3]; // 0x4f6d(0x03)
	struct UBP_1P_AnimationComponent_C* AnimationComponent1P; // 0x4f70(0x08)
	enum class EHW_1P_AnimationStates MovementState; // 0x4f78(0x01)
	enum class EHW_1P_AnimationStates PreviousMovementState; // 0x4f79(0x01)
	bool HW_IsRun; // 0x4f7a(0x01)
	bool IsCrouchedMoving; // 0x4f7b(0x01)
	bool IsCrouchedIdle; // 0x4f7c(0x01)
	bool HW_IsShooting; // 0x4f7d(0x01)
	bool ADSIsInit; // 0x4f7e(0x01)
	bool HW_IsMoving; // 0x4f7f(0x01)
	struct FADS_1P_AnimationStruct BasePose; // 0x4f80(0x10)
	bool IsCrouched; // 0x4f90(0x01)
	bool HW_1P_IsAiming; // 0x4f91(0x01)
	char pad_4F92[0x2]; // 0x4f92(0x02)
	struct FVector IKHandLOffsetLocation; // 0x4f94(0x0c)
	struct FRotator IKHandLOffsetRotation; // 0x4fa0(0x0c)
	bool IsDowned; // 0x4fac(0x01)
	bool IsReloadRecovery; // 0x4fad(0x01)
	bool IsDelayedReloading; // 0x4fae(0x01)
	char pad_4FAF[0x1]; // 0x4faf(0x01)
	struct FADS_1P_AnimationStruct ReloadPose; // 0x4fb0(0x10)
	struct AHWWeapon* CurrentWeapon; // 0x4fc0(0x08)
	bool IsRunning; // 0x4fc8(0x01)
	char pad_4FC9[0x3]; // 0x4fc9(0x03)
	float ReloadTime; // 0x4fcc(0x04)
	bool IsChangingWeapon; // 0x4fd0(0x01)
	bool SkipIKL; // 0x4fd1(0x01)
	bool SkipIKR; // 0x4fd2(0x01)
	bool UseLeftFingersAnim; // 0x4fd3(0x01)
	bool UseRightFingersAnim; // 0x4fd4(0x01)
	bool UseReloadFillerPose; // 0x4fd5(0x01)
	bool UseOffscreenFillerPose; // 0x4fd6(0x01)
	bool IsInUnequip; // 0x4fd7(0x01)
	bool IsInLadders; // 0x4fd8(0x01)
	bool IsNadeCancel; // 0x4fd9(0x01)
	bool IsNadeCooking; // 0x4fda(0x01)
	bool IsNadeFail; // 0x4fdb(0x01)
	bool NadeIsInAction; // 0x4fdc(0x01)
	bool ForceRunPose; // 0x4fdd(0x01)
	bool NadeIsOffscreen; // 0x4fde(0x01)
	bool LoadNade; // 0x4fdf(0x01)
	bool NadeIsCookable; // 0x4fe0(0x01)
	char pad_4FE1[0x3]; // 0x4fe1(0x03)
	float PlayrateJog; // 0x4fe4(0x04)
	float UnAimTime; // 0x4fe8(0x04)
	float AimTime; // 0x4fec(0x04)
	float OffRunTime; // 0x4ff0(0x04)
	float ToRunTime; // 0x4ff4(0x04)
	bool UseNadeMachine; // 0x4ff8(0x01)
	bool IsShootingOrAiming; // 0x4ff9(0x01)
	bool NadeIsLoadAndCoockable; // 0x4ffa(0x01)
	bool NadeIsLoadAndNotCoockable; // 0x4ffb(0x01)
	bool AN_NadeLoadCanTR; // 0x4ffc(0x01)
	bool AN_NadeThrowCanTR; // 0x4ffd(0x01)
	bool AN_ToCrouchCanTR; // 0x4ffe(0x01)
	bool AN_ToStandCanTR; // 0x4fff(0x01)
	bool IsAimingOrShooting; // 0x5000(0x01)
	bool AN_ToRunCanTR; // 0x5001(0x01)
	char pad_5002[0x2]; // 0x5002(0x02)
	float ReloadOffsetBlend; // 0x5004(0x04)
	struct FVector ReloadOffset; // 0x5008(0x0c)
	struct FVector IKHandGun_Location_orig; // 0x5014(0x0c)
	struct FVector IKHandRoot_Location_orig; // 0x5020(0x0c)
	struct FVector Spine02_Location_orig; // 0x502c(0x0c)
	bool IsReloading; // 0x5038(0x01)
	char pad_5039[0x7]; // 0x5039(0x07)
	struct FADS_1P_AnimationStruct FingerPoseLDefault; // 0x5040(0x10)
	struct FADS_1P_AnimationStruct FingerPoseRDefault; // 0x5050(0x10)
	struct FVector IK_wristposReloadOffset; // 0x5060(0x0c)
	bool IsItemEquipped; // 0x506c(0x01)
	char pad_506D[0x3]; // 0x506d(0x03)
	struct FRotator HandL_TwistRot; // 0x5070(0x0c)
	struct FVector LadderLeftHandMaster; // 0x507c(0x0c)
	struct FVector LadderRightHandMaster; // 0x5088(0x0c)
	struct FVector LadderSpineLocation; // 0x5094(0x0c)
	struct FRotator LadderSpineRotation; // 0x50a0(0x0c)
	float LadderLeftHandFingerposeDriver; // 0x50ac(0x04)
	float LadderRightHandFingerposeDriver; // 0x50b0(0x04)
	struct FRotator LadderLeftHandRotation; // 0x50b4(0x0c)
	struct FRotator LadderRightHandRotation; // 0x50c0(0x0c)
	bool IsClimbingLadder; // 0x50cc(0x01)
	char pad_50CD[0x3]; // 0x50cd(0x03)
	struct FVector IK_HandGun_Pos; // 0x50d0(0x0c)
	float HC_FingerposeBlendTime; // 0x50dc(0x04)
	struct FADS_1P_AnimationStruct FingerPoseLAiming; // 0x50e0(0x10)
	struct FADS_1P_AnimationStruct FingerPoseLHipFire; // 0x50f0(0x10)
	struct FADS_1P_AnimationStruct FingerPoseLAimFire; // 0x5100(0x10)
	struct FADS_1P_AnimationStruct FingerPoseRAiming; // 0x5110(0x10)
	struct FADS_1P_AnimationStruct FingerPoseRHipFire; // 0x5120(0x10)
	struct FADS_1P_AnimationStruct FingerPoseRAimFire; // 0x5130(0x10)
	bool FingerPoseLStateIsDefault; // 0x5140(0x01)
	char pad_5141[0x3]; // 0x5141(0x03)
	int32_t FingerPoseRState; // 0x5144(0x04)
	bool FingerPoseLStateIsHipFire; // 0x5148(0x01)
	bool FingerPoseLStateIsAiming; // 0x5149(0x01)
	bool FingerPoseLStateIsAimFire; // 0x514a(0x01)
	bool FingerPoseRStateIsDefault; // 0x514b(0x01)
	bool FingerPoseRStateIsAiming; // 0x514c(0x01)
	bool FingerPoseRStateIsAimFire; // 0x514d(0x01)
	bool FingerPoseRStateIsHipFire; // 0x514e(0x01)
	char pad_514F[0x1]; // 0x514f(0x01)
	float LeftHandIK_Blend; // 0x5150(0x04)
	float RightHandIK_Blend; // 0x5154(0x04)
	float UseLeftFingersAnimBlend; // 0x5158(0x04)
	float UseRightFingersAnimBlend; // 0x515c(0x04)
	struct FRotator HandR_TwistRot; // 0x5160(0x0c)
	struct FRotator NewVar_1; // 0x516c(0x0c)
	float HandleActionSpringDisable; // 0x5178(0x04)
	float IsHandItemFromCurve; // 0x517c(0x04)
	bool ItemEquipReady; // 0x5180(0x01)
	char pad_5181[0x3]; // 0x5181(0x03)
	struct FVector GunCurves; // 0x5184(0x0c)
	struct FVector PoleLCurves; // 0x5190(0x0c)
	struct FVector poleRCurves; // 0x519c(0x0c)
	struct FVector MeleeIKPosOffset; // 0x51a8(0x0c)
	struct FVector Item_MASTER_IKP; // 0x51b4(0x0c)
	struct UAnimSequence* GrenadeEquip_anim; // 0x51c0(0x08)
	struct UAnimSequence* GrenadeLoop_anim; // 0x51c8(0x08)
	struct UAnimSequence* ItemEquip; // 0x51d0(0x08)
	struct UAnimSequence* ItemIdleLoop; // 0x51d8(0x08)
	struct UAnimSequence* ItemUnequip; // 0x51e0(0x08)
	struct UAnimSequence* ItemUnequipQuick; // 0x51e8(0x08)
	struct UAnimSequence* ItemActionNormal; // 0x51f0(0x08)
	struct UAnimSequence* ItemActionQuick; // 0x51f8(0x08)
	bool MeleeIsUnequip; // 0x5200(0x01)
	char pad_5201[0x3]; // 0x5201(0x03)
	struct FVector Item_HandRPoleLocation; // 0x5204(0x0c)
	struct FVector Item_POffset; // 0x5210(0x0c)
	enum class EHWMeleeType Item_MeleeType; // 0x521c(0x01)
	bool Item_CanEnterAction; // 0x521d(0x01)
	bool Item_IsOccupied; // 0x521e(0x01)
	char pad_521F[0x1]; // 0x521f(0x01)
	float Item_LockIkGunToHandR; // 0x5220(0x04)
	enum class Enum_HeldItemTypesAnim Item_Type; // 0x5224(0x01)
	bool Item_UseBranch; // 0x5225(0x01)
	char pad_5226[0x2]; // 0x5226(0x02)
	float ItemActionLenght; // 0x5228(0x04)
	bool ItemIsInCooldown; // 0x522c(0x01)
	bool IsAimedReload; // 0x522d(0x01)
	char pad_522E[0x2]; // 0x522e(0x02)
	float IsAimedReloadBlend; // 0x5230(0x04)
	bool IsWalking; // 0x5234(0x01)
	char pad_5235[0x3]; // 0x5235(0x03)
	struct FTimerHandle NewVar_2; // 0x5238(0x08)
	struct UAnimSequenceBase* AimedNullPose; // 0x5240(0x08)

	void TwistBonesFix_Layer(struct FPoseLink InPose, struct FPoseLink TwistBonesFix_Layer); // Function ABP_Player_1p.ABP_Player_1p_C.TwistBonesFix_Layer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void Ladders_Layer(struct FPoseLink Ladders_Layer); // Function ABP_Player_1p.ABP_Player_1p_C.Ladders_Layer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void HeldItems_Layer(struct FPoseLink Input, struct FPoseLink HeldItems_Layer); // Function ABP_Player_1p.ABP_Player_1p_C.HeldItems_Layer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void DownedLayer_Temporary(struct FPoseLink NotDowned, struct FPoseLink DownedLayer_Temporary); // Function ABP_Player_1p.ABP_Player_1p_C.DownedLayer_Temporary // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
