// BlueprintGeneratedClass ADS_ARLData.ADS_ARLData_C
// Size: 0x78 (Inherited: 0x28)
struct UADS_ARLData_C : UObject {
	struct UCurveVector* RM_Position; // 0x28(0x08)
	struct UCurveVector* RM_Rotation; // 0x30(0x08)
	struct UCurveVector* AM_Position; // 0x38(0x08)
	struct UCurveVector* AM_Rotation; // 0x40(0x08)
	struct UCurveVector* NM_Position; // 0x48(0x08)
	struct UCurveVector* NM_Rotation; // 0x50(0x08)
	struct UCurveFloat* IDLE_ForzaFreq; // 0x58(0x08)
	struct UCurveFloat* Multipliers; // 0x60(0x08)
	struct UCurveVector* RH_Position; // 0x68(0x08)
	struct UCurveVector* RH_Rotation; // 0x70(0x08)
};

