// BlueprintGeneratedClass ADS_AAA_Base.ADS_AAA_Base_C
// Size: 0x148 (Inherited: 0x28)
struct UADS_AAA_Base_C : UObject {
	bool Use_ADS_ParamsOverride; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	float IsOpticalAimedRecoilMultiplier; // 0x2c(0x04)
	enum class EHWWeaponPartType MissingWeaponPartOverrride; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct UADS_AAA_Base_C* OverrideADSProfile; // 0x38(0x08)
	bool OverrideAimTime; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float AimTime; // 0x44(0x04)
	bool UnAimTimeIsAimTime; // 0x48(0x01)
	char pad_49[0x3]; // 0x49(0x03)
	float UnAimTime; // 0x4c(0x04)
	enum class EHW_AnimationWeaponType AnimationWeaponType; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
	struct UADS_RecoilData_C* RecoilData; // 0x58(0x08)
	struct UADS_OffsetData_C* OffsetData; // 0x60(0x08)
	struct UADS_AimDataBase_C* AimData; // 0x68(0x08)
	struct UADS_AimDataBase_C* AimDataOptical; // 0x70(0x08)
	float WeaponAimrootDepthFromCamera; // 0x78(0x04)
	bool Print_TimeBetweenShots; // 0x7c(0x01)
	bool Print_AimTime; // 0x7d(0x01)
	char pad_7E[0x2]; // 0x7e(0x02)
	struct FVector ReloadOffset_LeftForwardUp; // 0x80(0x0c)
	char pad_8C[0x4]; // 0x8c(0x04)
	struct UADS_RD_C* RunData; // 0x90(0x08)
	struct UADS_WD_C* WalkData; // 0x98(0x08)
	struct UADS_WD_C* AimedWalkData; // 0xa0(0x08)
	struct UADS_LD_C* LeadingDataRotation; // 0xa8(0x08)
	struct FHWWeaponAimpointParams SAP_Physics; // 0xb0(0x1c)
	struct FVector2D DEF_IdleForzaFreq; // 0xcc(0x08)
	struct FVector2D IRO_IdleForzaFreq; // 0xd4(0x08)
	struct FVector2D SNI_IdleForzaFreq; // 0xdc(0x08)
	char pad_E4[0x4]; // 0xe4(0x04)
	struct UCurveVector* Force; // 0xe8(0x08)
	struct UMatineeCameraShake* PerShotHips; // 0xf0(0x08)
	struct UMatineeCameraShake* PerShotAimed; // 0xf8(0x08)
	struct UMatineeCameraShake* WalkStepL; // 0x100(0x08)
	struct UMatineeCameraShake* WalkStepR; // 0x108(0x08)
	struct UMatineeCameraShake* RunStepL; // 0x110(0x08)
	struct UMatineeCameraShake* RunStepR; // 0x118(0x08)
	float WeaponMass; // 0x120(0x04)
	char pad_124[0x4]; // 0x124(0x04)
	struct UADS_MO_C* LeadingDataMoving; // 0x128(0x08)
	struct UADS_VDL_C* VaultDropLanding; // 0x130(0x08)
	struct UADS_PhysicsData_C* PhysicsData; // 0x138(0x08)
	struct UADS_ARLData_C* AimedReloadData; // 0x140(0x08)
};

