// BlueprintGeneratedClass BP_PlayerCharacter.BP_PlayerCharacter_C
// Size: 0x1b79 (Inherited: 0x12e8)
struct ABP_PlayerCharacter_C : ABP_PlayerCharacter_Logic_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x12e8(0x08)
	struct UPostProcessComponent* PostProcess_CameraDOF_Optical; // 0x12f0(0x08)
	struct UPostProcessComponent* PostProcess_Burn; // 0x12f8(0x08)
	struct UPostProcessComponent* PostProcess_Smoke; // 0x1300(0x08)
	struct UPostProcessComponent* PostProcess_Gas; // 0x1308(0x08)
	struct UPostProcessComponent* PostProcess_SpecterSystem; // 0x1310(0x08)
	struct USphereComponent* PostProcessVolume; // 0x1318(0x08)
	struct UBP_1P_CameraHandlerComponent_C* BP_1P_CameraHandlerComponent; // 0x1320(0x08)
	struct USpotLightComponent* 1PFill; // 0x1328(0x08)
	struct USpotLightComponent* 1PRim; // 0x1330(0x08)
	struct UPostProcessComponent* PostProcess_Bandage; // 0x1338(0x08)
	struct UPostProcessComponent* PostProcess_FlashDrone; // 0x1340(0x08)
	struct USceneCaptureComponent2D* SC_FlashBang; // 0x1348(0x08)
	struct UPostProcessComponent* PostProcess_JammedEffect; // 0x1350(0x08)
	struct UPostProcessComponent* PostProcess_FlashMine; // 0x1358(0x08)
	struct UChildActorComponent* Footstep_Sound_Emitter_BelowGround; // 0x1360(0x08)
	struct UPostProcessComponent* PostProcess_CombatEnhancer; // 0x1368(0x08)
	struct USpotLightComponent* FillerSpotLight; // 0x1370(0x08)
	struct UPostProcessComponent* PostProcess_CameraDOF_NonOptical; // 0x1378(0x08)
	struct UPostProcessComponent* PostProcess_Suppress; // 0x1380(0x08)
	struct UPostProcessComponent* PostProcess_FlashBangBlind; // 0x1388(0x08)
	struct UPostProcessComponent* PostProcess_Hit_Injured; // 0x1390(0x08)
	struct UPostProcessComponent* PostProcess_Bleeding; // 0x1398(0x08)
	float TL_Vault_TL_CameraZ_375C12CB44AA6E7AAD17E58E7AE1FBF1; // 0x13a0(0x04)
	float TL_Vault_TL_AimDotOpa_375C12CB44AA6E7AAD17E58E7AE1FBF1; // 0x13a4(0x04)
	float TL_Vault_TL_VaultMaster_375C12CB44AA6E7AAD17E58E7AE1FBF1; // 0x13a8(0x04)
	enum class ETimelineDirection TL_Vault__Direction_375C12CB44AA6E7AAD17E58E7AE1FBF1; // 0x13ac(0x01)
	char pad_13AD[0x3]; // 0x13ad(0x03)
	struct UTimelineComponent* TL_Vault; // 0x13b0(0x08)
	float FlashMineTL_FlashMineIntensity_57EF21464CCCB4C4F190758FBBD8B7EF; // 0x13b8(0x04)
	enum class ETimelineDirection FlashMineTL__Direction_57EF21464CCCB4C4F190758FBBD8B7EF; // 0x13bc(0x01)
	char pad_13BD[0x3]; // 0x13bd(0x03)
	struct UTimelineComponent* FlashMineTL; // 0x13c0(0x08)
	float DroneFlashTL_DroneFlashIntensity_B23F404C462DE2C7FA3E639A9FAC6BC7; // 0x13c8(0x04)
	enum class ETimelineDirection DroneFlashTL__Direction_B23F404C462DE2C7FA3E639A9FAC6BC7; // 0x13cc(0x01)
	char pad_13CD[0x3]; // 0x13cd(0x03)
	struct UTimelineComponent* DroneFlashTL; // 0x13d0(0x08)
	float TL_ADS_CamToAim_ToFov_BD63526447FE06B894F32584F4C39E35; // 0x13d8(0x04)
	enum class ETimelineDirection TL_ADS_CamToAim__Direction_BD63526447FE06B894F32584F4C39E35; // 0x13dc(0x01)
	char pad_13DD[0x3]; // 0x13dd(0x03)
	struct UTimelineComponent* TL_ADS_CamToAim; // 0x13e0(0x08)
	float Flash_FlashFloat_47E2ABF8465DF056B53D248F6353EDCF; // 0x13e8(0x04)
	enum class ETimelineDirection Flash__Direction_47E2ABF8465DF056B53D248F6353EDCF; // 0x13ec(0x01)
	char pad_13ED[0x3]; // 0x13ed(0x03)
	struct UTimelineComponent* Flash; // 0x13f0(0x08)
	float Hit_Injury_TL_BlendWeight_CurveFloat_2D0A47BA4083C7FB02C642A2F5772B80; // 0x13f8(0x04)
	float Hit_Injury_TL_InjuryHitFloat_2D0A47BA4083C7FB02C642A2F5772B80; // 0x13fc(0x04)
	enum class ETimelineDirection Hit_Injury_TL__Direction_2D0A47BA4083C7FB02C642A2F5772B80; // 0x1400(0x01)
	char pad_1401[0x7]; // 0x1401(0x07)
	struct UTimelineComponent* Hit_Injury_TL; // 0x1408(0x08)
	bool ShouldSprint; // 0x1410(0x01)
	char pad_1411[0x3]; // 0x1411(0x03)
	float AimYawDelta; // 0x1414(0x04)
	float VelocityDifference; // 0x1418(0x04)
	float CharacterRotationDifference; // 0x141c(0x04)
	float Direction; // 0x1420(0x04)
	float WalkingSpeed; // 0x1424(0x04)
	float RunningSpeed; // 0x1428(0x04)
	float SprintingSpeed; // 0x142c(0x04)
	float CrouchingSpeed; // 0x1430(0x04)
	float WalkingAcceleration; // 0x1434(0x04)
	float RunningAcceleration; // 0x1438(0x04)
	float WalkingDeceleration; // 0x143c(0x04)
	float RunningDeceleration; // 0x1440(0x04)
	float WalkingGroundFriction; // 0x1444(0x04)
	float RunningGroundFriction; // 0x1448(0x04)
	struct FRotator JumpRotation; // 0x144c(0x0c)
	float RotationOffset; // 0x1458(0x04)
	float RotationRateMultiplier; // 0x145c(0x04)
	float ForwardAxisValue; // 0x1460(0x04)
	float RightAxisValue; // 0x1464(0x04)
	bool IsAimingState; // 0x1468(0x01)
	char pad_1469[0x3]; // 0x1469(0x03)
	struct FName FirstPersonCameraSocket; // 0x146c(0x08)
	char pad_1474[0x4]; // 0x1474(0x04)
	struct UCurveFloat* CameraLerpCurve; // 0x1478(0x08)
	bool ShowTraces; // 0x1480(0x01)
	char pad_1481[0x3]; // 0x1481(0x03)
	struct FName PelvisBone; // 0x1484(0x08)
	struct FName RagdollPoseSnapshot; // 0x148c(0x08)
	struct FVector RagdollVelocity; // 0x1494(0x0c)
	struct FTransform FPCamStart_TR; // 0x14a0(0x30)
	struct FTransform CamJointTR; // 0x14d0(0x30)
	struct FTransform FPCamEnd_TR; // 0x1500(0x30)
	float CamToAnimCam_speed; // 0x1530(0x04)
	float CamToBPCam_speed; // 0x1534(0x04)
	char pad_1538[0x8]; // 0x1538(0x08)
	struct FTransform FPCamEnd_RootSpaceTR; // 0x1540(0x30)
	float FovWorld; // 0x1570(0x04)
	float FovWorldAiming; // 0x1574(0x04)
	float CamToAimSpeed; // 0x1578(0x04)
	struct FRotator FPCamStartRotation; // 0x157c(0x0c)
	float BleedRate; // 0x1588(0x04)
	char pad_158C[0x4]; // 0x158c(0x04)
	struct UMaterialInstanceDynamic* PP_DM_Injury_Ref; // 0x1590(0x08)
	float Panini_1PFov; // 0x1598(0x04)
	float Panini_1PFovD; // 0x159c(0x04)
	float SimpleRecoil_LR; // 0x15a0(0x04)
	float SimpleRecoil_UD; // 0x15a4(0x04)
	float DownRate_Current; // 0x15a8(0x04)
	float RightRate_Current; // 0x15ac(0x04)
	float SimpleRecoilKickRotation; // 0x15b0(0x04)
	float SimpleRecoilKick; // 0x15b4(0x04)
	float FovWeaponHip; // 0x15b8(0x04)
	float FovWeaponAim; // 0x15bc(0x04)
	struct UTextureRenderTarget* OpticalScopeRTTexture; // 0x15c0(0x08)
	float FovWeaponSnipers; // 0x15c8(0x04)
	float CrouchCamSpeed; // 0x15cc(0x04)
	float CrouchHeight; // 0x15d0(0x04)
	enum class EHWWeaponType CurrentWeaponType; // 0x15d4(0x01)
	char pad_15D5[0x3]; // 0x15d5(0x03)
	float TimeBetweenShots; // 0x15d8(0x04)
	enum class EHWWeaponFireMode FireMode; // 0x15dc(0x01)
	char pad_15DD[0x3]; // 0x15dd(0x03)
	int32_t BulletsPerBurst; // 0x15e0(0x04)
	float RecoilMultiplierWalking; // 0x15e4(0x04)
	float RecoilMultiplierHipFiring; // 0x15e8(0x04)
	float RecoilMultiplierCrouching; // 0x15ec(0x04)
	float AimSpeed; // 0x15f0(0x04)
	float WeaponFOVTemporaryOverride; // 0x15f4(0x04)
	struct FString WeaponGlass_MatSlot_Name; // 0x15f8(0x10)
	int32_t WeaponSlotNR; // 0x1608(0x04)
	float SuppressionMultiplier; // 0x160c(0x04)
	float SuppressionPerShot; // 0x1610(0x04)
	struct FVector AimPointOffset; // 0x1614(0x0c)
	float FP_Camera_Height_Actual; // 0x1620(0x04)
	struct FVector AimHandRotationMult; // 0x1624(0x0c)
	struct TArray<struct UMaterialInterface*> BloodSplatDecalsArray; // 0x1630(0x10)
	bool IsBleeding; // 0x1640(0x01)
	char pad_1641[0x7]; // 0x1641(0x07)
	struct FTimerHandle BleedTimerHandle; // 0x1648(0x08)
	float BleedDecalBaseSpeed; // 0x1650(0x04)
	bool IsDead; // 0x1654(0x01)
	char pad_1655[0x3]; // 0x1655(0x03)
	float AnimRecoil_IKCloserWhenShooting; // 0x1658(0x04)
	bool OutlinesOn; // 0x165c(0x01)
	char pad_165D[0x3]; // 0x165d(0x03)
	struct FVector CalculatedRecoilVector; // 0x1660(0x0c)
	struct FRotator CalculatedRecoilKickRotation; // 0x166c(0x0c)
	struct FTimerHandle AnimRecoilIsToClose_Handle; // 0x1678(0x08)
	struct FTimerHandle AnimRecoilIsOffClose_Handle; // 0x1680(0x08)
	struct UCameraModifier* CameraModifier; // 0x1688(0x08)
	struct FVector CalculatedRecoilVectorWithAimShootOffset; // 0x1690(0x0c)
	bool IsAutomatic; // 0x169c(0x01)
	char pad_169D[0x3]; // 0x169d(0x03)
	float CalculatedCameraFOV; // 0x16a0(0x04)
	char pad_16A4[0x4]; // 0x16a4(0x04)
	struct UMaterialInstanceDynamic* OpticalScopeMateral; // 0x16a8(0x08)
	float FP_Camera_DefaultHeight; // 0x16b0(0x04)
	bool IsCurrentlyFiring; // 0x16b4(0x01)
	bool IsOptical; // 0x16b5(0x01)
	char pad_16B6[0x2]; // 0x16b6(0x02)
	float AimZRotWalk; // 0x16b8(0x04)
	float AimZRotWalkCurrent; // 0x16bc(0x04)
	float AimZUpWalk; // 0x16c0(0x04)
	float AimZUpWalkCurrent; // 0x16c4(0x04)
	float AimWalkClampedVelocity; // 0x16c8(0x04)
	float AimWalkClampedVelocityLerped; // 0x16cc(0x04)
	struct FTimerHandle Timer_StartCoughing; // 0x16d0(0x08)
	struct TArray<struct FRotator> LookingRotationBuffer; // 0x16d8(0x10)
	struct ABP_BackPack_C* BackPackRef; // 0x16e8(0x08)
	bool inRagdoll; // 0x16f0(0x01)
	char pad_16F1[0x7]; // 0x16f1(0x07)
	struct TMap<enum class EHWArmorType, struct UMaterialInstance*> ArmorMaterialMap; // 0x16f8(0x50)
	struct USkeletalMeshComponent* MeshToProcess; // 0x1748(0x08)
	struct TArray<struct UMaterialInstanceDynamic*> ArmorMaterialsHead; // 0x1750(0x10)
	struct TArray<struct UMaterialInstanceDynamic*> ArmorMaterialsChest; // 0x1760(0x10)
	struct TArray<struct UMaterialInstanceDynamic*> ArmorMaterialsLegs; // 0x1770(0x10)
	float RTScopeCheckWallDistance; // 0x1780(0x04)
	float AimingBlend; // 0x1784(0x04)
	struct FMulticastInlineDelegate OnWeaponEquippedEvent; // 0x1788(0x10)
	struct FRotator AimHandRotation; // 0x1798(0x0c)
	struct FVector DofTargetPosition; // 0x17a4(0x0c)
	struct FVector AimPointOffsetCheck; // 0x17b0(0x0c)
	float AimRootDistanceFromAimPoint; // 0x17bc(0x04)
	enum class EHWWeaponPartType LeftHandGripPartData; // 0x17c0(0x01)
	char pad_17C1[0x7]; // 0x17c1(0x07)
	struct AHWWeaponPart* PartWithLhandsocket; // 0x17c8(0x08)
	struct FVector TickedLeftHandSocketPos; // 0x17d0(0x0c)
	struct FRotator TickedLeftHandSocketRot; // 0x17dc(0x0c)
	struct FRotator TickedLeftHandSocketRot_WS; // 0x17e8(0x0c)
	float HipsOverrideFromADSComponent; // 0x17f4(0x04)
	float AimADSComponentOverride; // 0x17f8(0x04)
	struct FRotator HW_ControlRotationCached; // 0x17fc(0x0c)
	struct FRotator HW_ControlRotationDelta; // 0x1808(0x0c)
	struct FVector HW_ControlRotationDeltaVector; // 0x1814(0x0c)
	float HW_ControlRotationVectorLength; // 0x1820(0x04)
	bool ActivePP; // 0x1824(0x01)
	char pad_1825[0x3]; // 0x1825(0x03)
	float BleedProgress; // 0x1828(0x04)
	bool HasBackpack; // 0x182c(0x01)
	char pad_182D[0x3]; // 0x182d(0x03)
	float BurnSmokeGas; // 0x1830(0x04)
	char pad_1834[0x4]; // 0x1834(0x04)
	struct FHWHeldItemAnimation DefaultUnequipAnimation; // 0x1838(0x58)
	struct FHWHeldItemAnimation EquipAnimation; // 0x1890(0x58)
	struct FHWHeldItemAnimation UnequipAnimation; // 0x18e8(0x58)
	struct FHWHeldItemAnimation IdleAnim; // 0x1940(0x58)
	bool OnlyUnequipIfAborted; // 0x1998(0x01)
	bool DoIdleAnim; // 0x1999(0x01)
	bool UseInteractionMultiplier; // 0x199a(0x01)
	char pad_199B[0x5]; // 0x199b(0x05)
	struct TArray<enum class EHWActionType> ThrowActionDisables; // 0x19a0(0x10)
	enum class HandItemDisableTypes HandItemDisableType; // 0x19b0(0x01)
	char pad_19B1[0x7]; // 0x19b1(0x07)
	struct TMap<enum class HandItemDisableTypes, struct FActionTypeMapArray> HandItemDisablesPerType; // 0x19b8(0x50)
	struct TArray<enum class EHWActionType> HandItemDisables; // 0x1a08(0x10)
	float GamepadInputHorizontalBoost; // 0x1a18(0x04)
	float AimBlendMasterLinear; // 0x1a1c(0x04)
	struct UCurveVector* OPA DOF FOV; // 0x1a20(0x08)
	float WorldFovBlendFromCurve; // 0x1a28(0x04)
	float DofPPBlendFromCurve; // 0x1a2c(0x04)
	float AimDotOpacityBlendFromCurve; // 0x1a30(0x04)
	struct FName RootBone; // 0x1a34(0x08)
	enum class EHWDamageType LastHitDamage; // 0x1a3c(0x01)
	char pad_1A3D[0x3]; // 0x1a3d(0x03)
	struct FHitResult LastHitResult; // 0x1a40(0x8c)
	char pad_1ACC[0x4]; // 0x1acc(0x04)
	struct TArray<enum class EHWActionType> HandItemAdditionalDisables; // 0x1ad0(0x10)
	float Shader1PBlendFromCurve; // 0x1ae0(0x04)
	char pad_1AE4[0x4]; // 0x1ae4(0x04)
	struct UCurveVector* C_OPA_DOF_FOV; // 0x1ae8(0x08)
	struct UCurveFloat* C_ShaderFOV; // 0x1af0(0x08)
	enum class EHW_1P_AnimationScopeType AnimScopeType; // 0x1af8(0x01)
	enum class ETimelineDirection AimDirection; // 0x1af9(0x01)
	char pad_1AFA[0x6]; // 0x1afa(0x06)
	struct UADS_AAA_Base_C* ADSDataCurrent; // 0x1b00(0x08)
	struct UADS_AimDataBase_C* ADS_AimDataCurrent; // 0x1b08(0x08)
	struct UADS_AimDataBase_C* ADS_AimDataCurrent_1; // 0x1b10(0x08)
	struct FTimerHandle FlinchOnArmorHitHandle; // 0x1b18(0x08)
	bool CanFlinch; // 0x1b20(0x01)
	char pad_1B21[0x3]; // 0x1b21(0x03)
	float HC_VaultTime; // 0x1b24(0x04)
	float VaultMaster; // 0x1b28(0x04)
	struct FVector VaultMeshRelativeLocation; // 0x1b2c(0x0c)
	bool HasAimMesh; // 0x1b38(0x01)
	bool AimMeshVisible; // 0x1b39(0x01)
	char pad_1B3A[0x2]; // 0x1b3a(0x02)
	float LeanAngleForReticule; // 0x1b3c(0x04)
	bool Is Melee Weapon; // 0x1b40(0x01)
	char pad_1B41[0x7]; // 0x1b41(0x07)
	struct UCurveFloat* C_HeldItemFov; // 0x1b48(0x08)
	struct FMulticastInlineDelegate EquipMelee_Dispatch; // 0x1b50(0x10)
	struct FMulticastInlineDelegate UnEquipMelee_Dispatch; // 0x1b60(0x10)
	float VaultTime; // 0x1b70(0x04)
	int32_t Vfx Tag; // 0x1b74(0x04)
	bool RagdollHasFinished; // 0x1b78(0x01)

	void GetMovementMode(enum class EHW_MovementMode Mode); // Function BP_PlayerCharacter.BP_PlayerCharacter_C.GetMovementMode // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void GetIsDead(bool Value); // Function BP_PlayerCharacter.BP_PlayerCharacter_C.GetIsDead // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // @ game+0x13c4ca0
	void GetExplosionVisibilityTargets(struct TArray<struct FVector> Targets); // Function BP_PlayerCharacter.BP_PlayerCharacter_C.GetExplosionVisibilityTargets // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void Init 3p Visibility Component(); // Function BP_PlayerCharacter.BP_PlayerCharacter_C.Init 3p Visibility Component // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
