// BlueprintGeneratedClass BP_PlayerCharacter_Anim.BP_PlayerCharacter_Anim_C
// Size: 0x26e5 (Inherited: 0x1b79)
struct ABP_PlayerCharacter_Anim_C : ABP_PlayerCharacter_C {
	char pad_1B79[0x7]; // 0x1b79(0x07)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1b80(0x08)
	struct USceneComponent* IkR_Pole; // 0x1b88(0x08)
	struct USceneComponent* HipsR_Helper; // 0x1b90(0x08)
	struct UBP_1P_AnimationComponent_C* BP_1P_AnimationComponent; // 0x1b98(0x08)
	struct UAIPerceptionStimuliSourceComponent* AIPerceptionStimuliSource; // 0x1ba0(0x08)
	struct UBP_AudioComponent_C* BP_AudioComponent; // 0x1ba8(0x08)
	struct USceneComponent* IK3P_PoleLHelper; // 0x1bb0(0x08)
	struct USceneComponent* IK3P_PoleLRotHelper; // 0x1bb8(0x08)
	struct USceneComponent* IK3P_PoleRHelper; // 0x1bc0(0x08)
	struct USceneComponent* IK3P_PoleRRotHelper; // 0x1bc8(0x08)
	struct USceneComponent* IK3P_IKTargetHelper; // 0x1bd0(0x08)
	struct USceneComponent* IK3P_RootRotHelper; // 0x1bd8(0x08)
	struct USceneComponent* IK3P_RootPosHelper; // 0x1be0(0x08)
	struct UArrowComponent* LadderArrowHelper_Other; // 0x1be8(0x08)
	struct UArrowComponent* LadderArrowHelper_Closest; // 0x1bf0(0x08)
	struct USceneComponent* RL_IK3P_RightArmPolePoint; // 0x1bf8(0x08)
	struct USceneComponent* RL_IK3P_RightArmPole; // 0x1c00(0x08)
	struct USceneComponent* RL_IK3P_LeftArmPolePoint; // 0x1c08(0x08)
	struct USceneComponent* RL_IK3P_LeftArmPole; // 0x1c10(0x08)
	struct UBP_3P_AnimationComponent_C* BP_3P_AnimationComponent; // 0x1c18(0x08)
	float TL_StartRun_Runner_2736F4DE412C2CDA387F6F96A84BC6C9; // 0x1c20(0x04)
	enum class ETimelineDirection TL_StartRun__Direction_2736F4DE412C2CDA387F6F96A84BC6C9; // 0x1c24(0x01)
	char pad_1C25[0x3]; // 0x1c25(0x03)
	struct UTimelineComponent* TL_StartRun; // 0x1c28(0x08)
	float TL_StartRunTransition_TL_ToRunTransition_MASTER_93A6BA43455321172F4B078F3A1B2809; // 0x1c30(0x04)
	enum class ETimelineDirection TL_StartRunTransition__Direction_93A6BA43455321172F4B078F3A1B2809; // 0x1c34(0x01)
	char pad_1C35[0x3]; // 0x1c35(0x03)
	struct UTimelineComponent* TL_StartRunTransition; // 0x1c38(0x08)
	float TL_3P_UnEquip_TL_UnEquip_MASTER_9A2606D54E0778C30CFCD3A34D86858E; // 0x1c40(0x04)
	enum class ETimelineDirection TL_3P_UnEquip__Direction_9A2606D54E0778C30CFCD3A34D86858E; // 0x1c44(0x01)
	char pad_1C45[0x3]; // 0x1c45(0x03)
	struct UTimelineComponent* TL_3P_UnEquip; // 0x1c48(0x08)
	float TL_3P_Equip_TL_3PEquipMASTER_634A07AD4A813BB3246E63B2A18267BC; // 0x1c50(0x04)
	enum class ETimelineDirection TL_3P_Equip__Direction_634A07AD4A813BB3246E63B2A18267BC; // 0x1c54(0x01)
	char pad_1C55[0x3]; // 0x1c55(0x03)
	struct UTimelineComponent* TL_3P_Equip; // 0x1c58(0x08)
	float TL_Recoil3PMASTER_TL_Recoil3P_MASTER_C1338B044177A572925A3D9FD939CDE7; // 0x1c60(0x04)
	enum class ETimelineDirection TL_Recoil3PMASTER__Direction_C1338B044177A572925A3D9FD939CDE7; // 0x1c64(0x01)
	char pad_1C65[0x3]; // 0x1c65(0x03)
	struct UTimelineComponent* TL_Recoil3PMASTER; // 0x1c68(0x08)
	float TL_EnterWalking_TL_EnterWalkMASTER_0446211340F6ECAAB3CCDF9E0A6C6895; // 0x1c70(0x04)
	enum class ETimelineDirection TL_EnterWalking__Direction_0446211340F6ECAAB3CCDF9E0A6C6895; // 0x1c74(0x01)
	char pad_1C75[0x3]; // 0x1c75(0x03)
	struct UTimelineComponent* TL_EnterWalking; // 0x1c78(0x08)
	float TL_IdleActionPlayer_TL_IsleActionMASTER_F4E100B84BC840E6306B74B25BAAE679; // 0x1c80(0x04)
	enum class ETimelineDirection TL_IdleActionPlayer__Direction_F4E100B84BC840E6306B74B25BAAE679; // 0x1c84(0x01)
	char pad_1C85[0x3]; // 0x1c85(0x03)
	struct UTimelineComponent* TL_IdleActionPlayer; // 0x1c88(0x08)
	float TL_AttachMag_TL_AttachMag_MASTER_7F5872604667B3E4623AC2813A50627B; // 0x1c90(0x04)
	enum class ETimelineDirection TL_AttachMag__Direction_7F5872604667B3E4623AC2813A50627B; // 0x1c94(0x01)
	char pad_1C95[0x3]; // 0x1c95(0x03)
	struct UTimelineComponent* TL_AttachMag; // 0x1c98(0x08)
	float TL_ARL_GrabNewMag_TL_GrabNewMag_MASTER_D203EC9F4DBE7A0EDED784999F70D96C; // 0x1ca0(0x04)
	enum class ETimelineDirection TL_ARL_GrabNewMag__Direction_D203EC9F4DBE7A0EDED784999F70D96C; // 0x1ca4(0x01)
	char pad_1CA5[0x3]; // 0x1ca5(0x03)
	struct UTimelineComponent* TL_ARL_GrabNewMag; // 0x1ca8(0x08)
	float TL_ARL_ReleaseHand_TL_ReleaseHand_MASTER_5CA4EFC24CD620AD0CD469BFFBEC0201; // 0x1cb0(0x04)
	enum class ETimelineDirection TL_ARL_ReleaseHand__Direction_5CA4EFC24CD620AD0CD469BFFBEC0201; // 0x1cb4(0x01)
	char pad_1CB5[0x3]; // 0x1cb5(0x03)
	struct UTimelineComponent* TL_ARL_ReleaseHand; // 0x1cb8(0x08)
	float TL_ARL_MagRelease_TL_MagRelease_Master_036E7AAF4909621A53089A85FA62BDF5; // 0x1cc0(0x04)
	enum class ETimelineDirection TL_ARL_MagRelease__Direction_036E7AAF4909621A53089A85FA62BDF5; // 0x1cc4(0x01)
	char pad_1CC5[0x3]; // 0x1cc5(0x03)
	struct UTimelineComponent* TL_ARL_MagRelease; // 0x1cc8(0x08)
	float TL_Landing_TL_LandingMaster_8B025C554DA233B6F0D24BB969BF0524; // 0x1cd0(0x04)
	enum class ETimelineDirection TL_Landing__Direction_8B025C554DA233B6F0D24BB969BF0524; // 0x1cd4(0x01)
	char pad_1CD5[0x3]; // 0x1cd5(0x03)
	struct UTimelineComponent* TL_Landing; // 0x1cd8(0x08)
	float MantleTimeline_BlendIn_307CB6F84E26ADE31A4CA5AC9248EEB0; // 0x1ce0(0x04)
	enum class ETimelineDirection MantleTimeline__Direction_307CB6F84E26ADE31A4CA5AC9248EEB0; // 0x1ce4(0x01)
	char pad_1CE5[0x3]; // 0x1ce5(0x03)
	struct UTimelineComponent* MantleTimeline; // 0x1ce8(0x08)
	enum class ALS_MovementState MovementState; // 0x1cf0(0x01)
	enum class ALS_MovementState PrevMovementState; // 0x1cf1(0x01)
	enum class ALS_RotationMode DesiredRotationMode; // 0x1cf2(0x01)
	enum class ALS_MovementAction MovementAction; // 0x1cf3(0x01)
	enum class ALS_RotationMode RotationMode; // 0x1cf4(0x01)
	enum class ALS_Gait DesiredGait; // 0x1cf5(0x01)
	enum class ALS_Gait Gait; // 0x1cf6(0x01)
	enum class ALS_Stance Stance; // 0x1cf7(0x01)
	enum class ALS_ViewMode ViewMode; // 0x1cf8(0x01)
	char pad_1CF9[0x3]; // 0x1cf9(0x03)
	struct FVector PreviousVelocity; // 0x1cfc(0x0c)
	struct FVector Acceleration_1; // 0x1d08(0x0c)
	bool IsMoving_ALS; // 0x1d14(0x01)
	bool HasMovementInput; // 0x1d15(0x01)
	char pad_1D16[0x2]; // 0x1d16(0x02)
	struct FRotator LastVelocityRotation; // 0x1d18(0x0c)
	struct FRotator LastMovementInputRotation; // 0x1d24(0x0c)
	float Speed; // 0x1d30(0x04)
	float MovementInputAmount; // 0x1d34(0x04)
	float PreviousAimYaw; // 0x1d38(0x04)
	struct FRotator TargetRotation; // 0x1d3c(0x0c)
	struct FRotator InAirRotation; // 0x1d48(0x0c)
	float YawOffset; // 0x1d54(0x04)
	struct FDataTableRowHandle MovementModel; // 0x1d58(0x10)
	struct FMovementSettings_State MovementData; // 0x1d68(0xc0)
	struct FMovementSettings CurrentMovementSettings; // 0x1e28(0x20)
	struct FMantle_Params MantleParams; // 0x1e48(0x28)
	struct FALS_ComponentAndTransform MantleLedgeLS; // 0x1e70(0x40)
	struct FTransform MantleTarget; // 0x1eb0(0x30)
	struct FTransform MantleActualStartOffset; // 0x1ee0(0x30)
	struct FTransform MantleAnimatedStartOffset; // 0x1f10(0x30)
	struct FMantle_TraceSettings GroundedTraceSettings; // 0x1f40(0x14)
	struct FMantle_TraceSettings AutomaticTraceSettings; // 0x1f54(0x14)
	struct FMantle_TraceSettings FallingTraceSettings; // 0x1f68(0x14)
	enum class ALS_Stance DesiredStance; // 0x1f7c(0x01)
	char pad_1F7D[0x3]; // 0x1f7d(0x03)
	float DownRate; // 0x1f80(0x04)
	float LookLeftRightRate; // 0x1f84(0x04)
	float AimYawRate; // 0x1f88(0x04)
	enum class ALS_OverlayState OverlayState; // 0x1f8c(0x01)
	char pad_1F8D[0x3]; // 0x1f8d(0x03)
	int32_t TimesPressedStance; // 0x1f90(0x04)
	bool BreakFall; // 0x1f94(0x01)
	bool SprintHeld; // 0x1f95(0x01)
	char pad_1F96[0x2]; // 0x1f96(0x02)
	struct UAnimInstance* ABP_3P; // 0x1f98(0x08)
	bool RagdollOnGround; // 0x1fa0(0x01)
	bool RagdollFaceUp; // 0x1fa1(0x01)
	char pad_1FA2[0x2]; // 0x1fa2(0x02)
	struct FVector LastRagdollVelocity; // 0x1fa4(0x0c)
	float ThirdPersonFOV; // 0x1fb0(0x04)
	float FirstPersonFOV; // 0x1fb4(0x04)
	bool RightShoulder; // 0x1fb8(0x01)
	char pad_1FB9[0x3]; // 0x1fb9(0x03)
	struct FRotator HW_ControlRotation; // 0x1fbc(0x0c)
	bool HW_IsAiming; // 0x1fc8(0x01)
	bool HW_UseVaultMontage; // 0x1fc9(0x01)
	enum class EHW_Anim_LeaningState AnimLeaningState; // 0x1fca(0x01)
	char pad_1FCB[0x1]; // 0x1fcb(0x01)
	struct FVector2D HW_ControlRotAuth; // 0x1fcc(0x08)
	bool HC_DrawALSDebugShapes; // 0x1fd4(0x01)
	char pad_1FD5[0x3]; // 0x1fd5(0x03)
	struct TArray<struct FString> CodePathDiag; // 0x1fd8(0x10)
	float HC_CameraHeight; // 0x1fe8(0x04)
	enum class EHW_1P_AnimationStates MovementState1P; // 0x1fec(0x01)
	char pad_1FED[0x3]; // 0x1fed(0x03)
	float CrouchCurveRunner; // 0x1ff0(0x04)
	char pad_1FF4[0xc]; // 0x1ff4(0x0c)
	struct FTransform CurrentCameraTransform; // 0x2000(0x30)
	struct FVector Mesh1PM_PositionOffset; // 0x2030(0x0c)
	struct FVector Mesh1PM_RotationMultiplier; // 0x203c(0x0c)
	struct FVector Mesh1PM_RotationOffset; // 0x2048(0x0c)
	struct FVector Mesh1PM_PositionMultiplier; // 0x2054(0x0c)
	struct FRotator CachedControlRotation; // 0x2060(0x0c)
	struct FRotator ControlRotationDirection; // 0x206c(0x0c)
	enum class EHW_WalkDirection HW_WalkDirection; // 0x2078(0x01)
	enum class EHW_StrafeDirection HW_StrafeDirection; // 0x2079(0x01)
	enum class EHW_LookDirectionHorizontal HW_LookDirectionHorizontal; // 0x207a(0x01)
	enum class EHW_LookDirectionVertical HW_LookDirectionVertical; // 0x207b(0x01)
	float _roundedRX; // 0x207c(0x04)
	float _roundedRY; // 0x2080(0x04)
	float _roundedRZ; // 0x2084(0x04)
	struct FName CurrentReceiverName; // 0x2088(0x08)
	float SmoothedCameraZ; // 0x2090(0x04)
	struct FVector ReloadCameraShakeMultiplier; // 0x2094(0x0c)
	bool ForceReloadFillerPose; // 0x20a0(0x01)
	bool UseOffscreenFillerPose; // 0x20a1(0x01)
	char pad_20A2[0x2]; // 0x20a2(0x02)
	float MoveForwardValue; // 0x20a4(0x04)
	float MoveRightValue; // 0x20a8(0x04)
	bool HW_IsInLadders; // 0x20ac(0x01)
	enum class EHW_WalkDirection HW_WalkDirectionPrevious; // 0x20ad(0x01)
	enum class EHW_StrafeDirection HW_StrafeDirectionPrevious; // 0x20ae(0x01)
	char pad_20AF[0x1]; // 0x20af(0x01)
	struct FMulticastInlineDelegate EnterMovementForwardDispatch; // 0x20b0(0x10)
	struct FMulticastInlineDelegate EnterMovementBackwardsDispatch; // 0x20c0(0x10)
	struct FMulticastInlineDelegate EnterMovementStopDispatch; // 0x20d0(0x10)
	struct FMulticastInlineDelegate EnterStrafeLeftDispatch; // 0x20e0(0x10)
	struct FMulticastInlineDelegate EnterStrafeRightDispatch; // 0x20f0(0x10)
	struct FMulticastInlineDelegate EnterStrafeStopDispatch; // 0x2100(0x10)
	struct AHWWeapon* CurrentWeapon; // 0x2110(0x08)
	bool IsKeyUPressed; // 0x2118(0x01)
	char pad_2119[0x7]; // 0x2119(0x07)
	struct FTimerHandle NadeTimerHandle; // 0x2120(0x08)
	struct FTimerHandle NadeCookHandle; // 0x2128(0x08)
	struct FTimerHandle NadeCookTimerHandle; // 0x2130(0x08)
	struct FMulticastInlineDelegate NadeIsCookingEventDispatch; // 0x2138(0x10)
	struct FMulticastInlineDelegate NadeIsThrowEventDispatch; // 0x2148(0x10)
	struct FMulticastInlineDelegate NadeIsFailEventDispatch; // 0x2158(0x10)
	struct FMulticastInlineDelegate NadeIsCancelEventDispatch; // 0x2168(0x10)
	bool IsGrenadeInAction; // 0x2178(0x01)
	char pad_2179[0x7]; // 0x2179(0x07)
	struct FTimerHandle NadeCooldownTimerHandle; // 0x2180(0x08)
	bool IsCookable; // 0x2188(0x01)
	char pad_2189[0x7]; // 0x2189(0x07)
	struct FMulticastInlineDelegate LoadNadeDispatch; // 0x2190(0x10)
	struct FTimerHandle NewVar_0_1; // 0x21a0(0x08)
	struct FMulticastInlineDelegate StepLEventDispatch; // 0x21a8(0x10)
	struct FMulticastInlineDelegate StepREventDispatch; // 0x21b8(0x10)
	float HC_AnimatedRunSpeed3P; // 0x21c8(0x04)
	char pad_21CC[0x4]; // 0x21cc(0x04)
	struct FMulticastInlineDelegate EnterFallingDispatch; // 0x21d0(0x10)
	struct FMulticastInlineDelegate ExitFallingDispatch; // 0x21e0(0x10)
	bool HW_IsWalking; // 0x21f0(0x01)
	bool HW_IsWalkingPrevious; // 0x21f1(0x01)
	char pad_21F2[0x6]; // 0x21f2(0x06)
	struct FMulticastInlineDelegate EnterWalkingDispatch; // 0x21f8(0x10)
	struct FMulticastInlineDelegate ExitWalkingDispatch; // 0x2208(0x10)
	struct FMulticastInlineDelegate StepLRunMultiEventDispatch; // 0x2218(0x10)
	struct FMulticastInlineDelegate StepRRunMultiEventDispatch; // 0x2228(0x10)
	float HC_CrouchTimeDown; // 0x2238(0x04)
	float HC_CrouchTimeUp; // 0x223c(0x04)
	struct UCurveFloat* C_CrouchDown; // 0x2240(0x08)
	struct UCurveFloat* C_CrouchUp; // 0x2248(0x08)
	struct FString CurrentWeaponDataName; // 0x2250(0x10)
	float HC_SKCamHeightOffsetHack; // 0x2260(0x04)
	bool HW_IsReloading; // 0x2264(0x01)
	char pad_2265[0x3]; // 0x2265(0x03)
	struct FMulticastInlineDelegate SetOriginalMagHiddenDispatch; // 0x2268(0x10)
	struct FMulticastInlineDelegate SpawnDropMagEventDispatch; // 0x2278(0x10)
	struct FMulticastInlineDelegate DropMagazineEventDispatch; // 0x2288(0x10)
	char pad_2298[0x8]; // 0x2298(0x08)
	struct FTransform Socket_HandL_grip_TR; // 0x22a0(0x30)
	struct FMulticastInlineDelegate SetOriginalMagVisibleDispatch; // 0x22d0(0x10)
	struct ABP_Ladder_C* CurrentLadderRef; // 0x22e0(0x08)
	float HC_LadderPointsGetterFrequency; // 0x22e8(0x04)
	char pad_22EC[0x4]; // 0x22ec(0x04)
	struct FMulticastInlineDelegate LadderEntryEventDispatch; // 0x22f0(0x10)
	struct FMulticastInlineDelegate GetLadderPointsEventDispatch; // 0x2300(0x10)
	struct FMulticastInlineDelegate LadderExitEventDispatch; // 0x2310(0x10)
	struct FMulticastInlineDelegate LadderJumpOffEventDispatch; // 0x2320(0x10)
	struct FMulticastInlineDelegate LadderStatesForABP; // 0x2330(0x10)
	struct FTimerHandle GetLadderPointsHandler; // 0x2340(0x08)
	struct UBP_1P_AnimationComponent_C* BP1PAnimComponentVAR; // 0x2348(0x08)
	enum class EHW_MeleeStates AxeMeleeStates; // 0x2350(0x01)
	char pad_2351[0x7]; // 0x2351(0x07)
	struct UCurveVector* LadderSecondaryHandCurve; // 0x2358(0x08)
	struct UCurveVector* LadderMainHandCurve; // 0x2360(0x08)
	struct FVector RightHandStepConstant; // 0x2368(0x0c)
	struct FVector RightHandStepLinear; // 0x2374(0x0c)
	struct FVector RightHandMaster; // 0x2380(0x0c)
	struct FVector LeftHandStepConstant; // 0x238c(0x0c)
	struct FVector LeftHandStepLinear; // 0x2398(0x0c)
	struct FVector LeftHandMaster; // 0x23a4(0x0c)
	float LadderHandForwardOffset; // 0x23b0(0x04)
	char pad_23B4[0x4]; // 0x23b4(0x04)
	struct ABP_ItemBase_Throwable_C* GrenadeToThrow; // 0x23b8(0x08)
	float LadderHandHeightOffset; // 0x23c0(0x04)
	float LadderStepEvalAsRatio; // 0x23c4(0x04)
	struct FVector LeftHandBeforeOffsets; // 0x23c8(0x0c)
	struct FVector RightHandBeforeOffsets; // 0x23d4(0x0c)
	float LadderLeftHandFingerposeDriver; // 0x23e0(0x04)
	float LadderRightHandFingerposeDriver; // 0x23e4(0x04)
	struct FVector LadderHandOffset; // 0x23e8(0x0c)
	struct FRotator LadderRightHandRotation; // 0x23f4(0x0c)
	struct FRotator LadderLeftHandRotation; // 0x2400(0x0c)
	struct FVector InterpSpotLeft; // 0x240c(0x0c)
	float LadderTPAnimDriver; // 0x2418(0x04)
	char pad_241C[0x4]; // 0x241c(0x04)
	struct TMap<struct ABP_Throwable_C*, struct FThrowableAnimStruct> ThrowableAnims; // 0x2420(0x50)
	struct FThrowableAnimStruct ThrowableAnimStruct; // 0x2470(0x98)
	bool NadeThrown; // 0x2508(0x01)
	bool ThrowIsInLoop; // 0x2509(0x01)
	bool IK3P_IsLeftShoulder; // 0x250a(0x01)
	char pad_250B[0x1]; // 0x250b(0x01)
	struct FVector IK3P_RootPosHelperOfffset; // 0x250c(0x0c)
	enum class EHW_FingerPoses FingerposeL; // 0x2518(0x01)
	enum class EHW_FingerPoses FingerposeR; // 0x2519(0x01)
	char pad_251A[0x6]; // 0x251a(0x06)
	struct FMulticastInlineDelegate SetFingerPoseL_Dispatch; // 0x2520(0x10)
	struct FMulticastInlineDelegate SetFingerPoseR_Dispatch; // 0x2530(0x10)
	float ToRunRunner; // 0x2540(0x04)
	char pad_2544[0x4]; // 0x2544(0x04)
	struct FMulticastInlineDelegate EnterRunDispatch; // 0x2548(0x10)
	struct FMulticastInlineDelegate ExitRunDispatch; // 0x2558(0x10)
	float HC_AllowedTurnAngleWhenLeaning; // 0x2568(0x04)
	char pad_256C[0x4]; // 0x256c(0x04)
	struct FMulticastInlineDelegate AttachMagToHand3P_EventDispatch; // 0x2570(0x10)
	struct FMulticastInlineDelegate AttachMagToHand3PABS_EventDispatch; // 0x2580(0x10)
	struct FMulticastInlineDelegate AttachMagToWeapon_EventDispatch; // 0x2590(0x10)
	float HC_AllowedTurnAngleWhenNotLeaning; // 0x25a0(0x04)
	float OldLeftHandDriver; // 0x25a4(0x04)
	float OldRightHandDriver; // 0x25a8(0x04)
	float LadderSoundTolerance; // 0x25ac(0x04)
	struct UAkAudioEvent* LadderSound1P; // 0x25b0(0x08)
	float HC_IsShootingThresholdTime; // 0x25b8(0x04)
	bool IsDelayedFiring; // 0x25bc(0x01)
	bool IsVaulting; // 0x25bd(0x01)
	bool IsMoving1P; // 0x25be(0x01)
	enum class EHW_1P_AnimationStates MovementState1P_Previous; // 0x25bf(0x01)
	enum class EHW_1P_AnimationStates MovementState1P_Temp; // 0x25c0(0x01)
	bool IsInLadderAction; // 0x25c1(0x01)
	char pad_25C2[0x6]; // 0x25c2(0x06)
	struct FMulticastInlineDelegate EnterMovementState_EventDispatch; // 0x25c8(0x10)
	struct FMulticastInlineDelegate ExitMovementState_EventDispatch; // 0x25d8(0x10)
	float LandingMaster; // 0x25e8(0x04)
	bool InLandingTick; // 0x25ec(0x01)
	char pad_25ED[0x3]; // 0x25ed(0x03)
	struct FMulticastInlineDelegate NadeEquipped_Dispatch; // 0x25f0(0x10)
	struct UHWHeldItemDataObject* HeldItemDataGrenade; // 0x2600(0x08)
	struct FMulticastInlineDelegate MeleeAttack_Dispatch; // 0x2608(0x10)
	struct UADS_ARLData_C* Aimed Reload Data Current PCA; // 0x2618(0x08)
	bool UsesAimedReload; // 0x2620(0x01)
	char pad_2621[0x3]; // 0x2621(0x03)
	struct FVector ARL_RM_Pos; // 0x2624(0x0c)
	struct FRotator ARL_RM_Rotation; // 0x2630(0x0c)
	float MagReleaseMaster; // 0x263c(0x04)
	float ReleaseHandMASTER; // 0x2640(0x04)
	float GrabNewMagMASTER; // 0x2644(0x04)
	float AttachMagMASTER; // 0x2648(0x04)
	char pad_264C[0x4]; // 0x264c(0x04)
	struct TArray<struct UADS_IdleAction_Base_C*> HC_IdleActionsArray; // 0x2650(0x10)
	int32_t IdleActionsLength; // 0x2660(0x04)
	char pad_2664[0x4]; // 0x2664(0x04)
	struct UADS_IdleAction_Base_C* IdleActionCurrent; // 0x2668(0x08)
	float IdleActionMASTER; // 0x2670(0x04)
	bool IsIdle; // 0x2674(0x01)
	char pad_2675[0x3]; // 0x2675(0x03)
	struct FTimerHandle IdleMainLoopHandle; // 0x2678(0x08)
	int32_t IdleActionIDOld; // 0x2680(0x04)
	int32_t IdleActionID; // 0x2684(0x04)
	bool IsInIdleAction; // 0x2688(0x01)
	char pad_2689[0x3]; // 0x2689(0x03)
	float EnterWalkMASTER; // 0x268c(0x04)
	struct UBP_3P_AnimationComponent_C* BP3PAnimationComponentVAR; // 0x2690(0x08)
	struct FMulticastInlineDelegate Send3PRecoilDrivers_Dispatch; // 0x2698(0x10)
	float New Track 0; // 0x26a8(0x04)
	float EquipTime; // 0x26ac(0x04)
	float Equip3PMASTER; // 0x26b0(0x04)
	float UnEquipTime; // 0x26b4(0x04)
	float UnEquip3PMASTER; // 0x26b8(0x04)
	float EquUnEqu3P MASTER; // 0x26bc(0x04)
	struct FMulticastInlineDelegate InspectWeapon_Dispatch; // 0x26c0(0x10)
	float ToRunTransitionMASTER; // 0x26d0(0x04)
	enum class EHW_AnimationWeaponType AnimWeaponType; // 0x26d4(0x01)
	char pad_26D5[0x3]; // 0x26d5(0x03)
	float ToRun_Time_BP; // 0x26d8(0x04)
	float ToRun_TRTime_BP; // 0x26dc(0x04)
	float OffRun_Time_BP; // 0x26e0(0x04)
	bool PrintShakeType; // 0x26e4(0x01)

	void BPI_Get_CameraParameters(float TP_FOV, float FP_FOV, bool RightShoulder); // Function BP_PlayerCharacter_Anim.BP_PlayerCharacter_Anim_C.BPI_Get_CameraParameters // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void BPI_Get_3P_TraceParams(struct FVector TraceOrigin, float TraceRadius, enum class ETraceTypeQuery TraceChannel); // Function BP_PlayerCharacter_Anim.BP_PlayerCharacter_Anim_C.BPI_Get_3P_TraceParams // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	struct FTransform BPI_Get_3P_PivotTarget(); // Function BP_PlayerCharacter_Anim.BP_PlayerCharacter_Anim_C.BPI_Get_3P_PivotTarget // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	struct FVector BPI_Get_FP_CameraTarget(); // Function BP_PlayerCharacter_Anim.BP_PlayerCharacter_Anim_C.BPI_Get_FP_CameraTarget // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
