// UserDefinedStruct BP_WeaponPartSlotData.BP_WeaponPartSlotData
// Size: 0x35 (Inherited: 0x00)
struct FBP_WeaponPartSlotData {
	struct FName PartId_2_935CCACD409EFB5039DE98AEB5299BE9; // 0x00(0x08)
	struct FName SetId_7_BB7812A24799A86721BC20A6C53CC27C; // 0x08(0x08)
	enum class EHWWeaponPartType Type_8_F02C7BE243F5744B05D82AB3D6FECEC9; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct FString WeaponItemId_11_8459049C4BD60CD778BCB9AEE56C6948; // 0x18(0x10)
	enum class EHW_WeaponSetsInfo SetInfo_16_6965C20C46E8F8E2A9140A8772B30B9F; // 0x28(0x01)
	bool ShowToolTipIfNotReceived_19_EF60FA8F4692EBABA5A68F9DF290D6A7; // 0x29(0x01)
	char pad_2A[0x2]; // 0x2a(0x02)
	struct FName AssembledWeaponId_22_CB1B15024720FFB78765B8A9EFA169E5; // 0x2c(0x08)
	bool Clickable_25_F8D5491548EF3FE36FCDB89A01953849; // 0x34(0x01)
};

