// BlueprintGeneratedClass BP_WeaponAssembly.BP_WeaponAssembly_C
// Size: 0x350 (Inherited: 0x220)
struct ABP_WeaponAssembly_C : AActor {
	struct UChildActorComponent* Barrel_BP; // 0x220(0x08)
	struct UStaticMeshComponent* Underbarrel_receiver; // 0x228(0x08)
	struct UStaticMeshComponent* Underbarrel; // 0x230(0x08)
	struct USkeletalMeshComponent* SK_Grip; // 0x238(0x08)
	struct USkeletalMeshComponent* SK_Barrel; // 0x240(0x08)
	struct UStaticMeshComponent* IronSight_Front_Pistol; // 0x248(0x08)
	struct USkeletalMeshComponent* SK_Magazine; // 0x250(0x08)
	struct UStaticMeshComponent* Muzzle; // 0x258(0x08)
	struct UStaticMeshComponent* IronSight_Front; // 0x260(0x08)
	struct USkeletalMeshComponent* SK_Stock; // 0x268(0x08)
	struct UStaticMeshComponent* IronSight_Back; // 0x270(0x08)
	struct UStaticMeshComponent* Magazine; // 0x278(0x08)
	struct UStaticMeshComponent* Scope; // 0x280(0x08)
	struct UStaticMeshComponent* Stock; // 0x288(0x08)
	struct UStaticMeshComponent* Grip; // 0x290(0x08)
	struct UStaticMeshComponent* Barrel; // 0x298(0x08)
	struct USkeletalMeshComponent* Receiver; // 0x2a0(0x08)
	enum class E_Assebly_WeaponNames WeaponName; // 0x2a8(0x01)
	char pad_2A9[0x7]; // 0x2a9(0x07)
	struct USkeletalMesh* Rec_SK; // 0x2b0(0x08)
	struct UStaticMesh* Bar_SM; // 0x2b8(0x08)
	struct UStaticMesh* Stock_SM; // 0x2c0(0x08)
	struct UStaticMesh* Scope_SM; // 0x2c8(0x08)
	struct UStaticMesh* Mag_SM; // 0x2d0(0x08)
	struct UStaticMesh* Grip_SM; // 0x2d8(0x08)
	struct UStaticMesh* Iro_F_SM; // 0x2e0(0x08)
	struct UStaticMesh* Iro_B_SM; // 0x2e8(0x08)
	struct UStaticMesh* Muz_SM; // 0x2f0(0x08)
	struct USkeletalMesh* SK_Stock_SK; // 0x2f8(0x08)
	struct USkeletalMesh* SK_Mag_SK; // 0x300(0x08)
	struct UStaticMesh* Iro_F_SM_Pistol; // 0x308(0x08)
	struct USkeletalMesh* SK_Barrel_SK; // 0x310(0x08)
	struct USkeletalMesh* SK_Grip_SK; // 0x318(0x08)
	struct UStaticMesh* UnderBarrel_SM; // 0x320(0x08)
	struct UMaterialInterface* MasterMaterial; // 0x328(0x08)
	bool ChangeAllMaterials; // 0x330(0x01)
	bool CustomDepth; // 0x331(0x01)
	char pad_332[0x6]; // 0x332(0x06)
	struct UStaticMesh* UnderBarrel_Receiver_SM; // 0x338(0x08)
	bool LChannel0; // 0x340(0x01)
	bool LChannel1; // 0x341(0x01)
	bool LChannel2; // 0x342(0x01)
	char pad_343[0x5]; // 0x343(0x05)
	struct AActor* BP_Barrel; // 0x348(0x08)

	void SetMaterial_SM(struct UStaticMeshComponent* Static Mesh); // Function BP_WeaponAssembly.BP_WeaponAssembly_C.SetMaterial_SM // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void SetMaterial_SK(struct USkeletalMeshComponent* SkeletalMesh); // Function BP_WeaponAssembly.BP_WeaponAssembly_C.SetMaterial_SK // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void UserConstructionScript(); // Function BP_WeaponAssembly.BP_WeaponAssembly_C.UserConstructionScript // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
};

