// UserDefinedStruct DS_Assebly_WeaponParts.DS_Assebly_WeaponParts
// Size: 0x88 (Inherited: 0x00)
struct FDS_Assebly_WeaponParts {
	struct USkeletalMesh* Receiver_12_09A74AE444E2994CB233B58A29D06C9B; // 0x00(0x08)
	struct UStaticMesh* Barrel_14_8D40C7D74C2070C15E1450B0F17CB5AA; // 0x08(0x08)
	struct USkeletalMesh* Barrel_SK_37_EF63B4EB4DCA957C108483BB3D026109; // 0x10(0x08)
	struct UStaticMesh* Stock_15_D634102D4C3260671C99C28BFF18E240; // 0x18(0x08)
	struct UStaticMesh* Scope_17_EFA7E2BC4D4385B4C7513FA7585B3B9C; // 0x20(0x08)
	struct UStaticMesh* Magazine_18_DE5BA1B8414D1C0778D6B2A10C187C46; // 0x28(0x08)
	struct UStaticMesh* Grip_19_FCF119A94DEA3061FB279CBA73BD6DDB; // 0x30(0x08)
	struct UStaticMesh* IronSight_Front_22_2E3EA3124FB8D52061A08BB7CEBF117F; // 0x38(0x08)
	struct UStaticMesh* IronSight_Front_Pistol_34_B7F42CB54988C1F4C3416B82F07C9103; // 0x40(0x08)
	struct UStaticMesh* IronSight_Back_24_CA253BF3471DCF12E3F4E2B5B699768E; // 0x48(0x08)
	struct UStaticMesh* muzzle_26_C7E6864A4D94BACC8481D3BEEB41BDC3; // 0x50(0x08)
	struct USkeletalMesh* Stock_SK_29_A17E446B4EA76D1D47191B87AD6EEC8A; // 0x58(0x08)
	struct USkeletalMesh* Magazine_SK_31_283146754C8DFBA3C7CAC5973EC64B6E; // 0x60(0x08)
	struct USkeletalMesh* Grip_SK_40_964F96C34590D31116DB7B8AE720B375; // 0x68(0x08)
	struct UStaticMesh* Underbarrel_43_BDE472AC4AF55599BFA5978ED1BD44B6; // 0x70(0x08)
	struct UStaticMesh* Underbarrel_receiver_46_5186EA774B98A86DD45BFFB83801C2AA; // 0x78(0x08)
	struct AActor* Barrel_BP_51_0A3E199D47B50C537D365CB6CA51EF71; // 0x80(0x08)
};

