// UserDefinedStruct FPlayerStats.FPlayerStats
// Size: 0x38 (Inherited: 0x00)
struct FFPlayerStats {
	struct FString PlayerName_2_D0EF978F4F01F7A972276AA66D653313; // 0x00(0x10)
	bool IsMe_8_84A9EA7E48323BA1A14D5783E01770BE; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	int32_t Kills_19_9C85F80D44C93AA1C05BA0A170558E15; // 0x14(0x04)
	int32_t Assists_21_98C646B84D3F8E8509E998BFDA784F70; // 0x18(0x04)
	bool Win_24_175254814F8E66FC9420D3ACF3EAEF8C; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)
	int32_t Team_28_2F3613914740A6426E9E41AF5EA59D0E; // 0x20(0x04)
	bool MVP_31_C971B34C4BB9A0273727C09B5BA61606; // 0x24(0x01)
	char pad_25[0x3]; // 0x25(0x03)
	struct FString PlayerId_34_0BC0210A4C32D7E522BA81BCD4546AE1; // 0x28(0x10)
};

