// UserDefinedStruct Mantle_Asset.Mantle_Asset
// Size: 0x34 (Inherited: 0x00)
struct FMantle_Asset {
	struct UAnimMontage* AnimMontage_42_63D6D9044A5DAB0EFBDC858CD9E37736; // 0x00(0x08)
	struct UCurveVector* PositionCorrectionCurve_43_0A4924AE48051202994680A7CE2D2C3A; // 0x08(0x08)
	struct FVector StartingOffset_30_FA0FF9D34F3BA3C50CF7C3928E516172; // 0x10(0x0c)
	float LowHeight_21_5CC2462A4191A12ECA9BDE85FA26C424; // 0x1c(0x04)
	float LowPlayRate_37_391A50444B0AD0F7DD66A9BE9C6C65CA; // 0x20(0x04)
	float LowStartPosition_22_17AF0D8346D9E966FE520FB93F149B66; // 0x24(0x04)
	float HighHeight_23_8A8982FC42C3B6CDF79429B8675C86D9; // 0x28(0x04)
	float HighPlayRate_39_7ABB38D5459C2FE20D6A24AB7820B2FD; // 0x2c(0x04)
	float HighStartPosition_24_D005813041B0EAEEB90490A469911497; // 0x30(0x04)
};

