// UserDefinedStruct ThrowableAnimStruct.ThrowableAnimStruct
// Size: 0x98 (Inherited: 0x00)
struct FThrowableAnimStruct {
	bool UseStaticMesh_28_7B2B2C294BAA5E68B2E19E9543B3C350; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct UStaticMesh* StaticMesh_12_7D6487B347BB2BA36C789FAF6EFFC609; // 0x08(0x08)
	struct USkeletalMesh* SkeletalMesh_11_9F2CE17449EBE596419958B5B57DFB04; // 0x10(0x08)
	enum class EHWUnequipType UnequipType_21_083B203149A0DA530800B782C57BB5B7; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	float HandFOV_26_D82D8DEA49BA5F5D2157B98BA226BD81; // 0x1c(0x04)
	struct FHandItemAnimStruct Start_16_0DFD22824B2A17733A126FB80351147D; // 0x20(0x28)
	struct FHandItemAnimStruct Loop_17_34EADF0949354970A21E05BD05120216; // 0x48(0x28)
	struct FHandItemAnimStruct Throw_18_6B5881F14EF32C49FA43199555B430CF; // 0x70(0x28)
};

