// WidgetBlueprintGeneratedClass WBP_Corporation.WBP_Corporation_C
// Size: 0x538 (Inherited: 0x268)
struct UWBP_Corporation_C : UHWWidgetBase {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x268(0x08)
	struct UWidgetAnimation* FadeWholeScreen; // 0x270(0x08)
	struct UWidgetAnimation* SelectMissionHighlight; // 0x278(0x08)
	struct UCanvasPanel* About; // 0x280(0x08)
	struct UVerticalBox* AboutRight; // 0x288(0x08)
	struct UVerticalBox* ActivePermit; // 0x290(0x08)
	struct UWBP_MainButton_C* BackButton; // 0x298(0x08)
	struct UWidgetSwitcher* BackgroundSwitcher; // 0x2a0(0x08)
	struct UWBP_CorporationBadge_C* BadgeBG; // 0x2a8(0x08)
	struct USizeBox* CancelButtonSlot; // 0x2b0(0x08)
	struct USizeBox* ContractStatusBox; // 0x2b8(0x08)
	struct UWBP_Corporations_Slideshow_C* Corporation_Image; // 0x2c0(0x08)
	struct UImage* CorporationLogo; // 0x2c8(0x08)
	struct UTextBlock* CurLevelLabel; // 0x2d0(0x08)
	struct UWBP_ImageButton_C* DevAddProgression; // 0x2d8(0x08)
	struct UEditableTextBox* DevAddProgressionAmount; // 0x2e0(0x08)
	struct UWBP_ImageButton_C* DevAddProgressionAmountButton; // 0x2e8(0x08)
	struct UWBP_Button_C* ExpireStage; // 0x2f0(0x08)
	struct UWBP_MainButton_C* FinalRewards; // 0x2f8(0x08)
	struct UWBP_ScreenHeader_C* Header; // 0x300(0x08)
	struct UImage* Image_226; // 0x308(0x08)
	struct UBorder* IntroBG; // 0x310(0x08)
	struct UWBP_SliderElement_C* LabelSlider; // 0x318(0x08)
	struct UVerticalBox* LeftPane; // 0x320(0x08)
	struct UWidgetSwitcher* LeftSubscreen; // 0x328(0x08)
	struct UWidgetSwitcher* LevelProgressIconSwitcher; // 0x330(0x08)
	struct URichTextBlock* LevelProgressLabel; // 0x338(0x08)
	struct UImage* LevelProgressLockImage; // 0x340(0x08)
	struct UImage* LogoBG; // 0x348(0x08)
	struct UWidgetSwitcher* MaxLevelSwitch; // 0x350(0x08)
	struct UVerticalBox* MissionList; // 0x358(0x08)
	struct UWidgetSwitcher* Missions; // 0x360(0x08)
	struct UVerticalBox* MissionsActive; // 0x368(0x08)
	struct UVerticalBox* MissionsFinalReward; // 0x370(0x08)
	struct UWBP_RichTextLabel_C* MissionsFinalReward_Description; // 0x378(0x08)
	struct UWBP_RichTextLabel_C* MissionsFinalReward_Header; // 0x380(0x08)
	struct UButton* MissionsInactive; // 0x388(0x08)
	struct UWBP_Label_C* MissionsNoContract; // 0x390(0x08)
	struct UOverlay* MissionsRight; // 0x398(0x08)
	struct UWBP_RichTextLabel_C* MultiplierActive_2; // 0x3a0(0x08)
	struct UWBP_RichTextLabel_C* MultiplierActive_3; // 0x3a8(0x08)
	struct UWBP_NavigationBar_C* NavigationBar; // 0x3b0(0x08)
	struct UTextBlock* NextLevelLabel; // 0x3b8(0x08)
	struct UWBP_Corporation_Status_Component_C* NotSigned; // 0x3c0(0x08)
	struct UOverlay* Overlay_4; // 0x3c8(0x08)
	struct UProgressBar* ProgressBar; // 0x3d0(0x08)
	struct UCanvasPanel* Progression; // 0x3d8(0x08)
	struct UWidgetSwitcher* ProgressionLockedSwitch; // 0x3e0(0x08)
	struct UImage* RepMultiplier_3; // 0x3e8(0x08)
	struct UWidgetSwitcher* RepMultiplierSwitch; // 0x3f0(0x08)
	struct UScrollBox* RewardsCards; // 0x3f8(0x08)
	struct UWidgetSwitcher* RightSubscreen; // 0x400(0x08)
	struct USizeBox* SignContract; // 0x408(0x08)
	struct UWBP_MainButton_C* SignContract_MainButton; // 0x410(0x08)
	struct UWBP_RichTextLabel_C* StageXMissions; // 0x418(0x08)
	struct UImage* T_Corporations_SelectMIssion_BG; // 0x420(0x08)
	struct UHorizontalBox* TagsList; // 0x428(0x08)
	struct UWBP_Box_C* WBP_Box; // 0x430(0x08)
	struct UWBP_Box_C* WBP_Box_Selectmission; // 0x438(0x08)
	struct UWBP_Corporation_InfoTag_C* WBP_Corporation_InfoTag1; // 0x440(0x08)
	struct UWBP_Corporation_InfoTag_C* WBP_Corporation_InfoTag2; // 0x448(0x08)
	struct UWBP_Corporation_InfoTag_C* WBP_Corporation_InfoTag3; // 0x450(0x08)
	struct UWBP_RichTextLabel_C* WBP_History; // 0x458(0x08)
	struct UWBP_Label_C* WBP_Label; // 0x460(0x08)
	struct UWBP_MainButton_C* WBP_MainButton; // 0x468(0x08)
	struct UWBP_Reward_C* WBP_Reward; // 0x470(0x08)
	struct UWBP_Reward_C* WBP_Reward_2; // 0x478(0x08)
	struct UWBP_Reward_C* WBP_Reward_3; // 0x480(0x08)
	struct UWBP_Reward_C* WBP_Reward_4; // 0x488(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel_C_7; // 0x490(0x08)
	struct UWBP_SectionHeader_C* WBP_SectionHeader; // 0x498(0x08)
	struct UWBP_SectionHeader_C* WBP_SectionHeader_2; // 0x4a0(0x08)
	struct UWBP_SectionHeader_C* WBP_SectionHeader_3; // 0x4a8(0x08)
	struct UWBP_RichTextLabel_C* WBP_Slogan; // 0x4b0(0x08)
	struct UWBP_SectionHeader_C* WBP_SubHeader; // 0x4b8(0x08)
	struct UWBP_SectionHeader_C* WBP_SubHeader_2; // 0x4c0(0x08)
	struct UImage* XpIcon; // 0x4c8(0x08)
	enum class EHWFaction Corporation; // 0x4d0(0x01)
	char pad_4D1[0x3]; // 0x4d1(0x03)
	int32_t Stage; // 0x4d4(0x04)
	int32_t XpToNextLevel; // 0x4d8(0x04)
	bool CanCancelStage; // 0x4dc(0x01)
	enum class EHWRarity MaxMissionRarity; // 0x4dd(0x01)
	char pad_4DE[0x2]; // 0x4de(0x02)
	int32_t CorporationLevel; // 0x4e0(0x04)
	char pad_4E4[0x4]; // 0x4e4(0x04)
	struct TArray<struct UObject*> StageScoreRows; // 0x4e8(0x10)
	int32_t CurrentLootBox; // 0x4f8(0x04)
	enum class EHWRarity CurrentRarity; // 0x4fc(0x01)
	char pad_4FD[0x3]; // 0x4fd(0x03)
	struct UWBP_Tooltip_C* MissionsLockedTooltip; // 0x500(0x08)
	struct TScriptInterface<None> LootBoxRenderer; // 0x508(0x10)
	bool ShowLootBoxInMissionsTab; // 0x518(0x01)
	char pad_519[0x3]; // 0x519(0x03)
	int32_t DevProgressionToAdd; // 0x51c(0x04)
	struct UObject* ContractStageDynamic; // 0x520(0x08)
	enum class EHWMissionState CurrentStageState; // 0x528(0x01)
	char pad_529[0x7]; // 0x529(0x07)
	struct UWBP_Tooltip_C* SignupNotAllowedTooltip; // 0x530(0x08)

	void OnPlayerDetailsChanged(struct FHWPlayerDetails Data); // Function WBP_Corporation.WBP_Corporation_C.OnPlayerDetailsChanged // (BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x13c4ca0
	void OnPlayerInventoryChanged(struct FHWPlayerInventory Data); // Function WBP_Corporation.WBP_Corporation_C.OnPlayerInventoryChanged // (BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x13c4ca0
	void OnPlayerMissionChanged(struct FHWPlayerMission Data); // Function WBP_Corporation.WBP_Corporation_C.OnPlayerMissionChanged // (BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x13c4ca0
	void OnPlayerProgressionChanged(struct FHWPlayerProgression Data); // Function WBP_Corporation.WBP_Corporation_C.OnPlayerProgressionChanged // (BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x13c4ca0
	void OnPlayerStatsChanged(struct FHWPlayerStats Data); // Function WBP_Corporation.WBP_Corporation_C.OnPlayerStatsChanged // (BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x13c4ca0
	void ExecuteUbergraph_WBP_Corporation(int32_t EntryPoint); // Function WBP_Corporation.WBP_Corporation_C.ExecuteUbergraph_WBP_Corporation // (Final|UbergraphFunction|HasDefaults) // @ game+0x13c4ca0
};

