// WidgetBlueprintGeneratedClass WBP_DebugMenuPage_AutomatedTests.WBP_DebugMenuPage_AutomatedTests_C
// Size: 0x2c8 (Inherited: 0x260)
struct UWBP_DebugMenuPage_AutomatedTests_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UWBP_Button_C* CraftedWeaponRarityUpgrade; // 0x268(0x08)
	struct UWBP_Button_C* ExecuteAllButton; // 0x270(0x08)
	struct UWBP_Button_C* ExecuteGroupButton; // 0x278(0x08)
	struct UWBP_Button_C* ExecuteTestButton; // 0x280(0x08)
	struct UComboBoxString* Item1ComboBox; // 0x288(0x08)
	struct UComboBoxString* Item2ComboBox; // 0x290(0x08)
	struct UWBP_Button_C* LoadoutTutorial; // 0x298(0x08)
	struct UComboBoxString* PrimaryWeaponComboBox; // 0x2a0(0x08)
	struct UComboBoxString* TestCombo; // 0x2a8(0x08)
	struct UComboBoxString* TestGroupCombo; // 0x2b0(0x08)
	struct UWBP_Button_C* WBP_Button; // 0x2b8(0x08)
	struct UWBP_DebugMenu_C* DebugMenu; // 0x2c0(0x08)

	void BndEvt__LoadoutTutorial_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(struct UWBP_Button_C* Button); // Function WBP_DebugMenuPage_AutomatedTests.WBP_DebugMenuPage_AutomatedTests_C.BndEvt__LoadoutTutorial_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x13c4ca0
	void StartLoadoutTutorialTest(bool Result); // Function WBP_DebugMenuPage_AutomatedTests.WBP_DebugMenuPage_AutomatedTests_C.StartLoadoutTutorialTest // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void Construct(); // Function WBP_DebugMenuPage_AutomatedTests.WBP_DebugMenuPage_AutomatedTests_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x13c4ca0
	void BndEvt__CraftedWeaponRarityUpgrade_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature(struct UWBP_Button_C* Button); // Function WBP_DebugMenuPage_AutomatedTests.WBP_DebugMenuPage_AutomatedTests_C.BndEvt__CraftedWeaponRarityUpgrade_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x13c4ca0
	void StartCraftedWeaponRarityUpgrade(bool Result); // Function WBP_DebugMenuPage_AutomatedTests.WBP_DebugMenuPage_AutomatedTests_C.StartCraftedWeaponRarityUpgrade // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void BndEvt__ExecuteAllButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature(struct UWBP_Button_C* Button); // Function WBP_DebugMenuPage_AutomatedTests.WBP_DebugMenuPage_AutomatedTests_C.BndEvt__ExecuteAllButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x13c4ca0
	void OnExecuteAllConfirmed(bool Result); // Function WBP_DebugMenuPage_AutomatedTests.WBP_DebugMenuPage_AutomatedTests_C.OnExecuteAllConfirmed // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void BndEvt__ExecuteGroupButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature(struct UWBP_Button_C* Button); // Function WBP_DebugMenuPage_AutomatedTests.WBP_DebugMenuPage_AutomatedTests_C.BndEvt__ExecuteGroupButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x13c4ca0
	void OnExecuteGroupConfirmed(bool Result); // Function WBP_DebugMenuPage_AutomatedTests.WBP_DebugMenuPage_AutomatedTests_C.OnExecuteGroupConfirmed // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void BndEvt__ExecuteTestButton_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature(struct UWBP_Button_C* Button); // Function WBP_DebugMenuPage_AutomatedTests.WBP_DebugMenuPage_AutomatedTests_C.BndEvt__ExecuteTestButton_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x13c4ca0
	void OnExecuteTestConfirmed(bool Result); // Function WBP_DebugMenuPage_AutomatedTests.WBP_DebugMenuPage_AutomatedTests_C.OnExecuteTestConfirmed // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void BndEvt__TestGroupCombo_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature(struct FString SelectedItem, enum class ESelectInfo SelectionType); // Function WBP_DebugMenuPage_AutomatedTests.WBP_DebugMenuPage_AutomatedTests_C.BndEvt__TestGroupCombo_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x13c4ca0
	void BndEvt__WBP_DebugMenuPage_AutomatedTests_WBP_Button_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature(struct UWBP_Button_C* Button); // Function WBP_DebugMenuPage_AutomatedTests.WBP_DebugMenuPage_AutomatedTests_C.BndEvt__WBP_DebugMenuPage_AutomatedTests_WBP_Button_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x13c4ca0
	void ExecuteUbergraph_WBP_DebugMenuPage_AutomatedTests(int32_t EntryPoint); // Function WBP_DebugMenuPage_AutomatedTests.WBP_DebugMenuPage_AutomatedTests_C.ExecuteUbergraph_WBP_DebugMenuPage_AutomatedTests // (Final|UbergraphFunction|HasDefaults) // @ game+0x13c4ca0
};

