// WidgetBlueprintGeneratedClass WBP_ShopItem_New.WBP_ShopItem_New_C
// Size: 0x533 (Inherited: 0x268)
struct UWBP_ShopItem_New_C : UHWWidgetBase {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x268(0x08)
	struct UWidgetAnimation* Hover; // 0x270(0x08)
	struct UImage* Background; // 0x278(0x08)
	struct UImage* BackgroundImage_Large; // 0x280(0x08)
	struct UImage* BackgroundImage_Medium; // 0x288(0x08)
	struct UImage* BackgroundImage_Small; // 0x290(0x08)
	struct UImage* BackgroundImage_SmallHorizontal; // 0x298(0x08)
	struct UImage* BackgroundImage_SmallVertical; // 0x2a0(0x08)
	struct UImage* BackgroundImage_XLarge; // 0x2a8(0x08)
	struct UImage* BackgroundImage_XXLarge; // 0x2b0(0x08)
	struct UBorder* CardHover; // 0x2b8(0x08)
	struct USizeBox* FreeTag; // 0x2c0(0x08)
	struct UButton* ItemButton; // 0x2c8(0x08)
	struct UWidgetSwitcher* ItemSizeSwitcher; // 0x2d0(0x08)
	struct USizeBox* Large; // 0x2d8(0x08)
	struct UWBP_RichTextLabel_C* LargeDescription; // 0x2e0(0x08)
	struct UListView* LargeDescription_ListView; // 0x2e8(0x08)
	struct UWidgetSwitcher* LargeDescriptionSwitcher; // 0x2f0(0x08)
	struct USizeBox* Medium; // 0x2f8(0x08)
	struct UWBP_ShopItem_OfferTag_C* OfferTag_large; // 0x300(0x08)
	struct UWBP_ShopItem_OfferTag_C* OfferTag_Medium; // 0x308(0x08)
	struct UWBP_ShopItem_OfferTag_C* OfferTag_Small; // 0x310(0x08)
	struct UWBP_ShopItem_OfferTag_C* OfferTag_SmallHorizontal; // 0x318(0x08)
	struct UWBP_ShopItem_OfferTag_C* OfferTag_SmallVertical; // 0x320(0x08)
	struct UWBP_ShopItem_OfferTag_C* OfferTag_XLarge; // 0x328(0x08)
	struct UWBP_ShopItem_OfferTag_C* OfferTag_XXLarge; // 0x330(0x08)
	struct UOverlay* Overlay_2; // 0x338(0x08)
	struct USizeBox* RarityBorder; // 0x340(0x08)
	struct UImage* RarityCardBorder; // 0x348(0x08)
	struct UBorder* RarityTag; // 0x350(0x08)
	struct UWBP_RichTextLabel_C* RarityText; // 0x358(0x08)
	struct USizeBox* Small; // 0x360(0x08)
	struct USizeBox* SmallHorizontal; // 0x368(0x08)
	struct USizeBox* SmallVertical; // 0x370(0x08)
	struct UImage* TextFader_L; // 0x378(0x08)
	struct UImage* TextFader_XL; // 0x380(0x08)
	struct UImage* TextFader_XXL; // 0x388(0x08)
	struct UWBP_RichTextLabel_C* Title_Large; // 0x390(0x08)
	struct UWBP_RichTextLabel_C* Title_Medium; // 0x398(0x08)
	struct UWBP_RichTextLabel_C* Title_Small; // 0x3a0(0x08)
	struct UWBP_RichTextLabel_C* Title_SmallHorizontal; // 0x3a8(0x08)
	struct UWBP_RichTextLabel_C* Title_SmallVertical; // 0x3b0(0x08)
	struct UWBP_RichTextLabel_C* Title_XLarge; // 0x3b8(0x08)
	struct UWBP_RichTextLabel_C* Title_XXLarge; // 0x3c0(0x08)
	struct UWBP_Box_C* WBP_Box; // 0x3c8(0x08)
	struct UWBP_DiscountTag_C* WBP_DiscountTag_L; // 0x3d0(0x08)
	struct UWBP_DiscountTag_C* WBP_DiscountTag_M; // 0x3d8(0x08)
	struct UWBP_DiscountTag_C* WBP_DiscountTag_S; // 0x3e0(0x08)
	struct UWBP_DiscountTag_C* WBP_DiscountTag_SH; // 0x3e8(0x08)
	struct UWBP_DiscountTag_C* WBP_DiscountTag_SV; // 0x3f0(0x08)
	struct UWBP_DiscountTag_C* WBP_DiscountTag_XL; // 0x3f8(0x08)
	struct UWBP_DiscountTag_C* WBP_DiscountTag_XXL; // 0x400(0x08)
	struct UWBP_Notification_C* WBP_Notification; // 0x408(0x08)
	struct UWBP_Shop_Item_PriceTag_C* WBP_Shop_Item_PriceTag_Large; // 0x410(0x08)
	struct UWBP_Shop_Item_PriceTag_C* WBP_Shop_Item_PriceTag_Medium; // 0x418(0x08)
	struct UWBP_Shop_Item_PriceTag_C* WBP_Shop_Item_PriceTag_Small; // 0x420(0x08)
	struct UWBP_Shop_Item_PriceTag_C* WBP_Shop_Item_PriceTag_SmallHorizontal; // 0x428(0x08)
	struct UWBP_Shop_Item_PriceTag_C* WBP_Shop_Item_PriceTag_SmallVertical; // 0x430(0x08)
	struct UWBP_Shop_Item_PriceTag_C* WBP_Shop_Item_PriceTag_XLarge; // 0x438(0x08)
	struct UWBP_Shop_Item_PriceTag_C* WBP_Shop_Item_PriceTag_XXLarge; // 0x440(0x08)
	struct USizeBox* XLarge; // 0x448(0x08)
	struct UListView* XLargeDescription_ListView; // 0x450(0x08)
	struct UWBP_RichTextLabel_C* XLDescription; // 0x458(0x08)
	struct UWidgetSwitcher* XLDescriptionSwitcher; // 0x460(0x08)
	struct USizeBox* XXLarge; // 0x468(0x08)
	struct UWBP_RichTextLabel_C* XXLargeDescription; // 0x470(0x08)
	struct UListView* XXLargeDescription_ListView; // 0x478(0x08)
	struct UWidgetSwitcher* XXLDescriptionSwitcher; // 0x480(0x08)
	struct FHWShopItem ItemData; // 0x488(0x78)
	enum class EHW_ShopItem_Size ItemSize; // 0x500(0x01)
	char pad_501[0x7]; // 0x501(0x07)
	struct FString SubsectionId; // 0x508(0x10)
	struct FString CampaignId; // 0x518(0x10)
	bool IsBundleCard; // 0x528(0x01)
	char pad_529[0x3]; // 0x529(0x03)
	int32_t BundleCardIndex; // 0x52c(0x04)
	enum class BPE_ShopItemType ItemType; // 0x530(0x01)
	bool IsClickable; // 0x531(0x01)
	bool IsNotificationOn; // 0x532(0x01)

	void GetOfferText(struct FText Text, struct FLinearColor BackgroundColor, enum class BPE_UIColors TextColor); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.GetOfferText // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x13c4ca0
	void GetBackgroundImage(enum class EHW_ShopItem_Size ItemSize, struct UImage* Image); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.GetBackgroundImage // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x13c4ca0
	void GetDefaultImageForCurrentItem(struct UTexture2D* Result); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.GetDefaultImageForCurrentItem // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x13c4ca0
	void GetRewardIcon(); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.GetRewardIcon // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void ShowNotification(bool Show); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.ShowNotification // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x13c4ca0
	void SetNotification(); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.SetNotification // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void SetOfferTagForInventoryItem(); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.SetOfferTagForInventoryItem // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void SetOfferTagForNonInventory(); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.SetOfferTagForNonInventory // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void SetRarity(); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.SetRarity // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void SetRewardTitle(int32_t ItemIndex); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.SetRewardTitle // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void GetOfferTagWidget(struct UWBP_ShopItem_OfferTag_C* OfferTag); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.GetOfferTagWidget // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x13c4ca0
	void SetOfferTag(bool IsOutOfStock); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.SetOfferTag // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void Load Shop Art Image(struct FString ID, enum class EHW_ShopItem_Size ItemSize, struct UTexture2D* Texture); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.Load Shop Art Image // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x13c4ca0
	void SetItemImage(struct FString ImageId, enum class EHW_ShopItem_Size ItemSize, int32_t Reward Index); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.SetItemImage // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void Set Description(); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.Set Description // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void SetBundleContent(int32_t RewardIndex, bool IsPurchased?); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.SetBundleContent // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void GetPriceTagWidget(struct UWBP_Shop_Item_PriceTag_C* PriceTagWidget); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.GetPriceTagWidget // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x13c4ca0
	void GetDiscountWidget(struct UWBP_DiscountTag_C* DiscountWidget); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.GetDiscountWidget // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x13c4ca0
	void GetTitleWidget(struct UWBP_RichTextLabel_C* Title); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.GetTitleWidget // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x13c4ca0
	void SetContent(); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.SetContent // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void OnPlayerDetailsChanged(struct FHWPlayerDetails Data); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.OnPlayerDetailsChanged // (BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x13c4ca0
	void OnPlayerInventoryChanged(struct FHWPlayerInventory Data); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.OnPlayerInventoryChanged // (BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x13c4ca0
	void OnPlayerMissionChanged(struct FHWPlayerMission Data); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.OnPlayerMissionChanged // (BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x13c4ca0
	void OnPlayerProgressionChanged(struct FHWPlayerProgression Data); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.OnPlayerProgressionChanged // (BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x13c4ca0
	void BP_OnEntryReleased(); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.BP_OnEntryReleased // (Event|Protected|BlueprintEvent) // @ game+0x13c4ca0
	void BP_OnItemExpansionChanged(bool bIsExpanded); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.BP_OnItemExpansionChanged // (Event|Protected|BlueprintEvent) // @ game+0x13c4ca0
	void BP_OnItemSelectionChanged(bool bIsSelected); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.BP_OnItemSelectionChanged // (Event|Protected|BlueprintEvent) // @ game+0x13c4ca0
	void OnListItemObjectSet(struct UObject* ListItemObject); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.OnListItemObjectSet // (Event|Protected|BlueprintEvent) // @ game+0x13c4ca0
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x13c4ca0
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x13c4ca0
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature(); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x13c4ca0
	void OnPlayerStatsChanged(struct FHWPlayerStats Data); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.OnPlayerStatsChanged // (BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x13c4ca0
	void ExecuteUbergraph_WBP_ShopItem_New(int32_t EntryPoint); // Function WBP_ShopItem_New.WBP_ShopItem_New_C.ExecuteUbergraph_WBP_ShopItem_New // (Final|UbergraphFunction|HasDefaults) // @ game+0x13c4ca0
};

