// WidgetBlueprintGeneratedClass WBP_Armory2_Popup_Weapon.WBP_Armory2_Popup_Weapon_C
// Size: 0x6e0 (Inherited: 0x268)
struct UWBP_Armory2_Popup_Weapon_C : UHWWidgetBase {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x268(0x08)
	struct UWBP_MainButton_C* BackButton; // 0x270(0x08)
	struct UWBP_Box_C* BG_Parameters; // 0x278(0x08)
	struct UWBP_Box_C* BG_Weapon_Parameters; // 0x280(0x08)
	struct UButton* BlueprintButton; // 0x288(0x08)
	struct UImage* BlueprintGridImage; // 0x290(0x08)
	struct UCanvasPanel* BlueprintPage; // 0x298(0x08)
	struct UImage* BorderLeft; // 0x2a0(0x08)
	struct UWBP_RichTextLabel_C* BPCodeCount; // 0x2a8(0x08)
	struct UHorizontalBox* BPCodes; // 0x2b0(0x08)
	struct UWBP_Armory2_Title_Bar_C* BpParamGroup1; // 0x2b8(0x08)
	struct UWBP_Armory2_Title_Bar_C* BpParamGroup2; // 0x2c0(0x08)
	struct UWBP_Armory2_Title_Bar_C* BpParamGroup3; // 0x2c8(0x08)
	struct UWBP_Armory2_Title_Bar_C* BpParamGroup4; // 0x2d0(0x08)
	struct UWBP_Armory2_Title_Bar_C* BpParamGroup5; // 0x2d8(0x08)
	struct UCanvasPanel* Canvas; // 0x2e0(0x08)
	struct UWBP_Armory2_Rarity_Card_Detailed_C* CommonCard; // 0x2e8(0x08)
	struct UBackgroundBlur* CraftBlockBackground; // 0x2f0(0x08)
	struct UBorder* CraftBlockBorder; // 0x2f8(0x08)
	struct UWBP_Button_C* CraftButton; // 0x300(0x08)
	struct UWBP_CurrencyCost_C* CraftingCost; // 0x308(0x08)
	struct UWidgetSwitcher* CraftingSwitcher; // 0x310(0x08)
	struct UHorizontalBox* CraftPage_Default; // 0x318(0x08)
	struct UHorizontalBox* CraftPage_No_Blueprint; // 0x320(0x08)
	struct UHorizontalBox* CraftPage_No_Slots; // 0x328(0x08)
	struct UImage* CurrentItemRarityIndicator; // 0x330(0x08)
	struct UWBP_RichTextLabel_C* CurrentPartTitle; // 0x338(0x08)
	struct UWBP_MainButton_C* DismantleWeaponButton; // 0x340(0x08)
	struct UWBP_Armory2_Rarity_Card_Detailed_C* EpicCard; // 0x348(0x08)
	struct UVerticalBox* ExpectedRarity; // 0x350(0x08)
	struct UImage* FactionLogo; // 0x358(0x08)
	struct UImage* Image; // 0x360(0x08)
	struct UImage* Image_80; // 0x368(0x08)
	struct UImage* Image_156; // 0x370(0x08)
	struct UImage* Image_363; // 0x378(0x08)
	struct UImage* Image_Arrow; // 0x380(0x08)
	struct UImage* Image_BPCodes; // 0x388(0x08)
	struct UImage* Image_Darken; // 0x390(0x08)
	struct UCanvasPanel* ItemPage; // 0x398(0x08)
	struct UWidgetSwitcher* ItemPageSwitcher; // 0x3a0(0x08)
	struct UButton* ItemParametersClickable; // 0x3a8(0x08)
	struct UWBP_Armory2_Title_Bar_C* ItemParamGroup1; // 0x3b0(0x08)
	struct UWBP_Armory2_Title_Bar_C* ItemParamGroup2; // 0x3b8(0x08)
	struct UWBP_Armory2_Title_Bar_C* ItemParamGroup3; // 0x3c0(0x08)
	struct UWBP_Armory2_Title_Bar_C* ItemParamGroup4; // 0x3c8(0x08)
	struct UWBP_Armory2_Title_Bar_C* ItemParamGroup5; // 0x3d0(0x08)
	struct UListView* ItemSlotListView; // 0x3d8(0x08)
	struct UWBP_Armory2_Rarity_Card_Detailed_C* LegendaryCard; // 0x3e0(0x08)
	struct UWBP_RichTextLabel_C* ModelName; // 0x3e8(0x08)
	struct UWidgetSwitcher* ModeSwitcher; // 0x3f0(0x08)
	struct UImage* NaviBar; // 0x3f8(0x08)
	struct UVerticalBox* NoRarityUpgrade; // 0x400(0x08)
	struct UWBP_Button_C* OpenInLoadout; // 0x408(0x08)
	struct UWidgetSwitcher* PageSwitcher; // 0x410(0x08)
	struct UButton* ParametersClickable; // 0x418(0x08)
	struct UWBP_Armory2_Parameter_Group_C* Part_PG_First; // 0x420(0x08)
	struct UWBP_Armory2_Parameter_Group_C* Part_PG_Second; // 0x428(0x08)
	struct UListView* PartList; // 0x430(0x08)
	struct UOverlay* PartListContainer; // 0x438(0x08)
	struct UWBP_MainButton_C* PartPickerBackButton; // 0x440(0x08)
	struct UCanvasPanel* PartPickerPage; // 0x448(0x08)
	struct UWBP_MainButton_C* PartPickerResetButton; // 0x450(0x08)
	struct UWBP_ScreenHeader_C* PartPickerTitle; // 0x458(0x08)
	struct UOverlay* PartPopupContainer; // 0x460(0x08)
	struct UOverlay* PopupRoot; // 0x468(0x08)
	struct UWBP_Armory2_Rarity_Card_Detailed_C* RareCard; // 0x470(0x08)
	struct UWBP_Armory2_Rarity_Card_C* RarityCardCommon; // 0x478(0x08)
	struct UWBP_Armory2_Rarity_Card_C* RarityCardEpic; // 0x480(0x08)
	struct UWBP_Armory2_Rarity_Card_C* RarityCardLegendary; // 0x488(0x08)
	struct UWBP_Armory2_Rarity_Card_C* RarityCardRare; // 0x490(0x08)
	struct UWBP_Armory2_Rarity_Card_C* RarityCardUncommon; // 0x498(0x08)
	struct UWidgetSwitcher* RarityElementSwitcher; // 0x4a0(0x08)
	struct UWBP_Armory2_Rarity_Card_C* RarityProgress_NextRarity; // 0x4a8(0x08)
	struct UWBP_Armory2_Rarity_Card_C* RarityProgress_PreviousRarity; // 0x4b0(0x08)
	struct UWBP_RichTextLabel_C* RarityProgress_Title_2; // 0x4b8(0x08)
	struct UWBP_RichTextLabel_C* RarityProgress_Value; // 0x4c0(0x08)
	struct UProgressBar* RarityProgressBar; // 0x4c8(0x08)
	struct UWBP_RichTextLabel_C* RarityTextDelete; // 0x4d0(0x08)
	struct UWBP_MainButton_C* RarityUpgradeButton; // 0x4d8(0x08)
	struct UVerticalBox* RarityUpgradeComplete; // 0x4e0(0x08)
	struct UVerticalBox* RarityUpgradeInProgress; // 0x4e8(0x08)
	struct UWBP_MainButton_C* RenameWeaponButton; // 0x4f0(0x08)
	struct UWBP_MainButton_C* ReprogramButton; // 0x4f8(0x08)
	struct UImage* ResultRarityIcon; // 0x500(0x08)
	struct UImage* ResultRarityIndicator; // 0x508(0x08)
	struct UWBP_RichTextLabel_C* ResultRarityText; // 0x510(0x08)
	struct UOverlay* RootPage_Default; // 0x518(0x08)
	struct UWidgetSwitcher* RootSwitcher; // 0x520(0x08)
	struct UWBP_SectionHeaderBlack_C* SectionBlueprintParams; // 0x528(0x08)
	struct UWBP_SectionHeaderBlack_C* SectionBlueprintParams_2; // 0x530(0x08)
	struct UWBP_SectionHeaderBlack_C* SectionRarity; // 0x538(0x08)
	struct UBorder* SelectedPartNameBorder; // 0x540(0x08)
	struct UWBP_ScreenHeader_C* SingleWeaponHeader; // 0x548(0x08)
	struct UWidgetSwitcher* SingleWeaponSwitcher; // 0x550(0x08)
	struct UWBP_Item_Tag_Container_C* Tags; // 0x558(0x08)
	struct UWBP_Button_C* TestFocusButton1; // 0x560(0x08)
	struct UWBP_Button_C* TestFocusButton2; // 0x568(0x08)
	struct UWBP_Button_C* TestFocusButton3; // 0x570(0x08)
	struct UWBP_Button_C* TestFocusButton4; // 0x578(0x08)
	struct UWBP_Armory2_Rarity_Card_Detailed_C* UnCommonCard; // 0x580(0x08)
	struct UWBP_RichTextLabel_C* UnspentUpgradePointsAmount; // 0x588(0x08)
	struct UHorizontalBox* UnspentUpgradePointsElement; // 0x590(0x08)
	struct UWBP_MainButton_C* UpgradeWeaponButton; // 0x598(0x08)
	struct UImage* VendorLogo; // 0x5a0(0x08)
	struct UWBP_Box_C* WBP_Box_2; // 0x5a8(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel; // 0x5b0(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel_2; // 0x5b8(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel_121; // 0x5c0(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel_186; // 0x5c8(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel_219; // 0x5d0(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel_315; // 0x5d8(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel_363; // 0x5e0(0x08)
	struct UWBP_Armory2_Weapon_Card_C* WeaponCardForBlueprint; // 0x5e8(0x08)
	struct UHorizontalBox* WeaponModificationList; // 0x5f0(0x08)
	struct UWBP_RichTextLabel_C* WeaponNameLabel; // 0x5f8(0x08)
	struct UCanvasPanel* WeaponPropertiesPage; // 0x600(0x08)
	struct UWBP_Armory2_Sockets_C* WeaponSocketsLayer; // 0x608(0x08)
	struct UHWArmoryItem* BlueprintArmoryItem; // 0x610(0x08)
	struct TArray<struct UHWArmoryWeaponItem*> WeaponItems; // 0x618(0x10)
	struct UHWWeaponParameters* CurrentBlueprintParameters; // 0x628(0x08)
	struct UHWArmoryWeaponItem* CurrentWeaponItem; // 0x630(0x08)
	struct UHWWeaponParameters* CurrentWeaponParameters; // 0x638(0x08)
	bool SingleWeaponMode; // 0x640(0x01)
	enum class EHWWeaponPartType PartPicker_CurrentPartType; // 0x641(0x01)
	char pad_642[0x2]; // 0x642(0x02)
	struct FName PartPicker_OriginalPartIdInSlot; // 0x644(0x08)
	bool PartPicker_OriginalPartIdWasFound; // 0x64c(0x01)
	char pad_64D[0x3]; // 0x64d(0x03)
	struct UHWPartItem* PartPicker_OriginalPartItem; // 0x650(0x08)
	struct UHWWeaponParameters* PartPreviewParameters; // 0x658(0x08)
	struct UHWPartItem* DefaultWeaponPartItem; // 0x660(0x08)
	struct UHWArmoryWeaponItem* TemporaryWeaponItem; // 0x668(0x08)
	struct UHWArmoryWeaponItem* WeaponItemForBlueprint; // 0x670(0x08)
	int32_t CurrentWeaponItemIndex; // 0x678(0x04)
	enum class EHWRarity CurrentResultRarity; // 0x67c(0x01)
	char pad_67D[0x3]; // 0x67d(0x03)
	struct TSoftObjectPtr<struct UWBP_Armory2_Popup_Params_C> ParameterPopup; // 0x680(0x28)
	struct FMulticastInlineDelegate OnPartPickerClosed; // 0x6a8(0x10)
	bool SkipCraftingConfirmation; // 0x6b8(0x01)
	char pad_6B9[0x7]; // 0x6b9(0x07)
	struct FMulticastInlineDelegate BeingRemovedFromParent; // 0x6c0(0x10)
	bool AnyPartSelected; // 0x6d0(0x01)
	bool IgnoreClosePart; // 0x6d1(0x01)
	char pad_6D2[0x6]; // 0x6d2(0x06)
	struct UHWPartItem* SelectedWeaponPart; // 0x6d8(0x08)

	void OnBack(bool IsHandled); // Function WBP_Armory2_Popup_Weapon.WBP_Armory2_Popup_Weapon_C.OnBack // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void ShowMaterialCurrency(enum class EHWRarity Rarity, enum class EHWVendor Vendor); // Function WBP_Armory2_Popup_Weapon.WBP_Armory2_Popup_Weapon_C.ShowMaterialCurrency // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void Update Weapon with Part(enum class EHWWeaponPartType ModifiedPartType, struct FName ModifiedPartId, bool ModifiedPartExists); // Function WBP_Armory2_Popup_Weapon.WBP_Armory2_Popup_Weapon_C.Update Weapon with Part // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void UpdateWeaponCardForBlueprint(); // Function WBP_Armory2_Popup_Weapon.WBP_Armory2_Popup_Weapon_C.UpdateWeaponCardForBlueprint // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
