// WidgetBlueprintGeneratedClass WBP_WorkTabWidget.WBP_WorkTabWidget_C
// Size: 0x590 (Inherited: 0x268)
struct UWBP_WorkTabWidget_C : UHWWidgetBase {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x268(0x08)
	struct UWidgetAnimation* OnHover; // 0x270(0x08)
	struct UVerticalBox* ActiveMissions; // 0x278(0x08)
	struct UWBP_RichTextLabel_C* ActiveStageText; // 0x280(0x08)
	struct UWBP_RichTextLabel_C* ActiveStageTimerText; // 0x288(0x08)
	struct UImage* AddMissionsImage; // 0x290(0x08)
	struct UWBP_RichTextLabel_C* AllMissionsLabel; // 0x298(0x08)
	struct UImage* Background; // 0x2a0(0x08)
	struct UImage* BackgroundGlow; // 0x2a8(0x08)
	struct UImage* BackgroundGlow_2; // 0x2b0(0x08)
	struct UOverlay* BeforeLevel2; // 0x2b8(0x08)
	struct UImage* BG_Image; // 0x2c0(0x08)
	struct UImage* BG_Image_2; // 0x2c8(0x08)
	struct UImage* BoxBg; // 0x2d0(0x08)
	struct UButton* Button_1; // 0x2d8(0x08)
	struct UButton* Button_2; // 0x2e0(0x08)
	struct UImage* CheckmarrkImage; // 0x2e8(0x08)
	struct UImage* CheckmarrkImage_2; // 0x2f0(0x08)
	struct UOverlay* CollectBox; // 0x2f8(0x08)
	struct UButton* CollectBoxButton; // 0x300(0x08)
	struct UOverlay* CollectRewards; // 0x308(0x08)
	struct UWBP_RichTextLabel_C* CompletedLabel; // 0x310(0x08)
	struct UImage* CorporationLogo; // 0x318(0x08)
	struct UTextBlock* CurLevelLabel; // 0x320(0x08)
	struct UImage* Divider; // 0x328(0x08)
	struct UImage* Divider_2; // 0x330(0x08)
	struct UImage* FarmiraLogo; // 0x338(0x08)
	struct UHorizontalBox* Header_ActiveStage; // 0x340(0x08)
	struct UHorizontalBox* Header_AllStagesCompleted; // 0x348(0x08)
	struct UHorizontalBox* Header_CompletedStage; // 0x350(0x08)
	struct UHorizontalBox* Header_LockedMissions; // 0x358(0x08)
	struct UHorizontalBox* Header_NotActiveStage; // 0x360(0x08)
	struct UHorizontalBox* Header_UnlockedMissions; // 0x368(0x08)
	struct UImage* Image_169; // 0x370(0x08)
	struct UImage* Image_219; // 0x378(0x08)
	struct UOverlay* Level2Unlocked; // 0x380(0x08)
	struct UVerticalBox* List_of_Missions; // 0x388(0x08)
	struct UWBP_RichTextLabel_C* LockedLabel; // 0x390(0x08)
	struct UOverlay* LockedMissions; // 0x398(0x08)
	struct UImage* LootBoxImage; // 0x3a0(0x08)
	struct UImage* MashMediaLogo; // 0x3a8(0x08)
	struct UWBP_RichTextLabel_C* MatchesToUnlockLabel; // 0x3b0(0x08)
	struct UWBP_Mission_Card_HUB_C* MissionCard1; // 0x3b8(0x08)
	struct UWBP_Mission_Card_HUB_C* MissionCard2; // 0x3c0(0x08)
	struct UWBP_Mission_Card_HUB_C* MissionCard3; // 0x3c8(0x08)
	struct USizeBox* Missions_Locked; // 0x3d0(0x08)
	struct UVerticalBox* MissionsVerticalBox; // 0x3d8(0x08)
	struct UHorizontalBox* Multiplier; // 0x3e0(0x08)
	struct UWBP_RichTextLabel_C* MultiplierDescription; // 0x3e8(0x08)
	struct UWBP_RichTextLabel_C* MultiplierValue; // 0x3f0(0x08)
	struct UTextBlock* NextLevelLabel; // 0x3f8(0x08)
	struct UWBP_RichTextLabel_C* NextUpdateLabel; // 0x400(0x08)
	struct UWBP_RichTextLabel_C* NotActiveStageText; // 0x408(0x08)
	struct UWBP_RichTextLabel_C* NotActiveStageTimerText; // 0x410(0x08)
	struct UImage* NWF_Logo; // 0x418(0x08)
	struct UProgressBar* ProgressBar; // 0x420(0x08)
	struct UOverlay* ProgressionLayout; // 0x428(0x08)
	struct UBorder* RairtyBorder; // 0x430(0x08)
	struct UBorder* RairtyBorder_2; // 0x438(0x08)
	struct UImage* RewardGlow; // 0x440(0x08)
	struct UButton* SelectMissionButton; // 0x448(0x08)
	struct UOverlay* SelectMissions; // 0x450(0x08)
	struct UWBP_RichTextLabel_C* SelectMissionsDescriptionText; // 0x458(0x08)
	struct UWBP_RichTextLabel_C* StageCompletedText; // 0x460(0x08)
	struct UWBP_RichTextLabel_C* StageNumber_4; // 0x468(0x08)
	struct UWBP_RichTextLabel_C* StageNumber_5; // 0x470(0x08)
	struct UWBP_RichTextLabel_C* StageNumber_6; // 0x478(0x08)
	struct UImage* StarImage; // 0x480(0x08)
	struct UWBP_RichTextLabel_C* StarsCompletedText; // 0x488(0x08)
	struct UWBP_RichTextLabel_C* TasksLabel; // 0x490(0x08)
	struct UWidgetSwitcher* TasksLockedSwitcher; // 0x498(0x08)
	struct UWBP_RichTextLabel_C* TimerLabel; // 0x4a0(0x08)
	struct UWBP_RichTextLabel_C* UnlockDescription; // 0x4a8(0x08)
	struct UWBP_Box_C* WBP_Box; // 0x4b0(0x08)
	struct UWBP_Box_C* WBP_Box_2; // 0x4b8(0x08)
	struct UWBP_Box_C* WBP_Box_3; // 0x4c0(0x08)
	struct UWBP_Box_C* WBP_Box_4; // 0x4c8(0x08)
	struct UWBP_Box_C* WBP_Box_5; // 0x4d0(0x08)
	struct UWBP_Box_C* WBP_Box_6; // 0x4d8(0x08)
	struct UWBP_Box_C* WBP_Box_7; // 0x4e0(0x08)
	struct UWBP_Box_C* WBP_Box_8; // 0x4e8(0x08)
	struct UWBP_Box_C* WBP_Box_9; // 0x4f0(0x08)
	struct UWBP_Box_C* WBP_Box_142; // 0x4f8(0x08)
	struct UWBP_Box_C* WBP_Box_246; // 0x500(0x08)
	struct UWBP_MainButton_C* WBP_CheckFinalRewards; // 0x508(0x08)
	struct UWBP_MainButton_C* WBP_MainButton; // 0x510(0x08)
	struct UWBP_Qualification_EntryPoint_C* WBP_Qualification_EntryPoint; // 0x518(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel; // 0x520(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel_3; // 0x528(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel_4; // 0x530(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_CorporationLevel; // 0x538(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_MIssionHeader; // 0x540(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_MissionsBlock; // 0x548(0x08)
	struct UBP_MissionTypeItem_C* MissionItem; // 0x550(0x08)
	bool ShowSelectedState; // 0x558(0x01)
	char pad_559[0x3]; // 0x559(0x03)
	int32_t ActiveStageNumber; // 0x55c(0x04)
	struct TArray<struct UWBP_MissionsPreviewRow_C*> ActiveMissionsList; // 0x560(0x10)
	struct TArray<enum class EHWFaction> AllVendors; // 0x570(0x10)
	struct TArray<struct UBP_Mission_Item_Data_C*> MissionItems; // 0x580(0x10)

	void ShouldPromoteWeekendMission(struct FHWMission Mission, bool bPromote); // Function WBP_WorkTabWidget.WBP_WorkTabWidget_C.ShouldPromoteWeekendMission // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x13c4ca0
	void CheckAndSetMissionsLocked(); // Function WBP_WorkTabWidget.WBP_WorkTabWidget_C.CheckAndSetMissionsLocked // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void UpdateActiveMissions(struct TArray<struct UBP_Mission_Item_Data_C*> MissionItems); // Function WBP_WorkTabWidget.WBP_WorkTabWidget_C.UpdateActiveMissions // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	bool CompareMissionActivationTimes(struct UObject* First, struct UObject* Second); // Function WBP_WorkTabWidget.WBP_WorkTabWidget_C.CompareMissionActivationTimes // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void OnPlayerDetailsChanged(struct FHWPlayerDetails Data); // Function WBP_WorkTabWidget.WBP_WorkTabWidget_C.OnPlayerDetailsChanged // (BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x13c4ca0
	void OnPlayerInventoryChanged(struct FHWPlayerInventory Data); // Function WBP_WorkTabWidget.WBP_WorkTabWidget_C.OnPlayerInventoryChanged // (BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x13c4ca0
	void OnPlayerProgressionChanged(struct FHWPlayerProgression Data); // Function WBP_WorkTabWidget.WBP_WorkTabWidget_C.OnPlayerProgressionChanged // (BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x13c4ca0
	void OnPlayerStatsChanged(struct FHWPlayerStats Data); // Function WBP_WorkTabWidget.WBP_WorkTabWidget_C.OnPlayerStatsChanged // (BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x13c4ca0
	void BP_OnEntryReleased(); // Function WBP_WorkTabWidget.WBP_WorkTabWidget_C.BP_OnEntryReleased // (Event|Protected|BlueprintEvent) // @ game+0x13c4ca0
	void BP_OnItemExpansionChanged(bool bIsExpanded); // Function WBP_WorkTabWidget.WBP_WorkTabWidget_C.BP_OnItemExpansionChanged // (Event|Protected|BlueprintEvent) // @ game+0x13c4ca0
	void BP_OnItemSelectionChanged(bool bIsSelected); // Function WBP_WorkTabWidget.WBP_WorkTabWidget_C.BP_OnItemSelectionChanged // (Event|Protected|BlueprintEvent) // @ game+0x13c4ca0
	void OnListItemObjectSet(struct UObject* ListItemObject); // Function WBP_WorkTabWidget.WBP_WorkTabWidget_C.OnListItemObjectSet // (Event|Protected|BlueprintEvent) // @ game+0x13c4ca0
	void OnPlayerMissionChanged(struct FHWPlayerMission Data); // Function WBP_WorkTabWidget.WBP_WorkTabWidget_C.OnPlayerMissionChanged // (BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x13c4ca0
	void UpdateMissions(struct TArray<struct FHWMission> Missions); // Function WBP_WorkTabWidget.WBP_WorkTabWidget_C.UpdateMissions // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void Construct(); // Function WBP_WorkTabWidget.WBP_WorkTabWidget_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x13c4ca0
	void OnEnableStateChanged(bool Enabled); // Function WBP_WorkTabWidget.WBP_WorkTabWidget_C.OnEnableStateChanged // (Event|Public|BlueprintEvent) // @ game+0x13c4ca0
	void BndEvt__WBP_WorkTabWidget_Button_0_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(); // Function WBP_WorkTabWidget.WBP_WorkTabWidget_C.BndEvt__WBP_WorkTabWidget_Button_0_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x13c4ca0
	void BndEvt__WBP_WorkTabWidget_Button_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // Function WBP_WorkTabWidget.WBP_WorkTabWidget_C.BndEvt__WBP_WorkTabWidget_Button_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x13c4ca0
	void BndEvt__WBP_WorkTabWidget_Button_0_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function WBP_WorkTabWidget.WBP_WorkTabWidget_C.BndEvt__WBP_WorkTabWidget_Button_0_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x13c4ca0
	void ExecuteUbergraph_WBP_WorkTabWidget(int32_t EntryPoint); // Function WBP_WorkTabWidget.WBP_WorkTabWidget_C.ExecuteUbergraph_WBP_WorkTabWidget // (Final|UbergraphFunction|HasDefaults) // @ game+0x13c4ca0
};

