// WidgetBlueprintGeneratedClass WBP_InputSettingsPage_Stadia.WBP_InputSettingsPage_Stadia_C
// Size: 0x2a8 (Inherited: 0x260)
struct UWBP_InputSettingsPage_Stadia_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UWidgetAnimation* ButtonHighlight_Anim; // 0x268(0x08)
	struct UImage* DividerLine; // 0x270(0x08)
	struct UHorizontalRadioSelect_C* PresetSelector; // 0x278(0x08)
	struct UWBP_SettingRow_C* SettingRow; // 0x280(0x08)
	struct UWBP_SettingRow_C* SettingRow_2; // 0x288(0x08)
	struct UWBP_GamepadBindings_C* WBP_GamepadBindings; // 0x290(0x08)
	struct UWBP_SectionHeader_C* WBP_SectionHeader1; // 0x298(0x08)
	struct UWBP_SectionHeader_C* WBP_SectionHeader1_2; // 0x2a0(0x08)

	void Construct(); // Function WBP_InputSettingsPage_Stadia.WBP_InputSettingsPage_Stadia_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x13c4ca0
	void ExecuteUbergraph_WBP_InputSettingsPage_Stadia(int32_t EntryPoint); // Function WBP_InputSettingsPage_Stadia.WBP_InputSettingsPage_Stadia_C.ExecuteUbergraph_WBP_InputSettingsPage_Stadia // (Final|UbergraphFunction) // @ game+0x13c4ca0
};

