// WidgetBlueprintGeneratedClass WBP_Rigs.WBP_Rigs_C
// Size: 0x991 (Inherited: 0x270)
struct UWBP_Rigs_C : UWBP_MenuScreenBase_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x270(0x08)
	struct UWBP_Rigs_ArmorSetButton_C* ArmorSetButton; // 0x278(0x08)
	struct UHorizontalBox* AssPanel; // 0x280(0x08)
	struct UBorder* Border_159; // 0x288(0x08)
	struct UWBP_Button_C* Button_Briefing; // 0x290(0x08)
	struct UWBP_MainButton_C* Button_CancelAccessoryCategorySelection; // 0x298(0x08)
	struct UWBP_MainButton_C* Button_CancelAccessoryItemSelection; // 0x2a0(0x08)
	struct UWBP_MainButton_C* Button_CancelArmorBadgeSelection; // 0x2a8(0x08)
	struct UWBP_MainButton_C* Button_CancelArmorModCategorySelection_2; // 0x2b0(0x08)
	struct UWBP_MainButton_C* Button_CancelArmorSetSelection; // 0x2b8(0x08)
	struct UWBP_MainButton_C* Button_CancelArmorSkinSelection; // 0x2c0(0x08)
	struct UWBP_MainButton_C* Button_CancelASSSelection; // 0x2c8(0x08)
	struct UWBP_MainButton_C* Button_CancelCharacterMain; // 0x2d0(0x08)
	struct UWBP_MainButton_C* Button_CancelCharacterMain_2; // 0x2d8(0x08)
	struct UWBP_MainButton_C* Button_CancelDroneAbilitySelection; // 0x2e0(0x08)
	struct UWBP_MainButton_C* Button_CancelFaceSelect; // 0x2e8(0x08)
	struct UWBP_MainButton_C* Button_CancelItemCategorySelect; // 0x2f0(0x08)
	struct UWBP_MainButton_C* Button_CancelItemSelect; // 0x2f8(0x08)
	struct UWBP_MainButton_C* Button_CancelWeaponCategorySelect; // 0x300(0x08)
	struct UWBP_MainButton_C* Button_CancelWeaponSelect; // 0x308(0x08)
	struct UWBP_MainButton_C* Button_Rename; // 0x310(0x08)
	struct UWBP_Button_C* Button_Rigs; // 0x318(0x08)
	struct UWBP_Button_C* Button_Save; // 0x320(0x08)
	struct UWBP_MainButton_C* Button_SaveAsNew; // 0x328(0x08)
	struct UWBP_Rigs_CharacterSlotButton_C* Button_SelectAccessories; // 0x330(0x08)
	struct UWBP_Rigs_CharacterSlotButton_C* Button_SelectArmorMods; // 0x338(0x08)
	struct UWBP_Rigs_CharacterSlotButton_C* Button_SelectFace; // 0x340(0x08)
	struct UWBP_Rigs_ItemCategory_C* CategoryArmorBadges; // 0x348(0x08)
	struct UWBP_Rigs_ItemCategory_C* CategoryArmorSkins; // 0x350(0x08)
	struct UWBP_Rigs_ItemCategory_C* CategoryBackpackBadges; // 0x358(0x08)
	struct UWBP_Rigs_ItemCategory_C* CategoryBackpackCharms; // 0x360(0x08)
	struct UWBP_Rigs_ItemCategory_C* CategoryBackpacks; // 0x368(0x08)
	struct UWBP_Rigs_DroneAbilityButton_C* CompanionAbilityActive; // 0x370(0x08)
	struct UBorder* DebugDirtyMarker; // 0x378(0x08)
	struct UImage* DiagLines; // 0x380(0x08)
	struct UImage* Divider; // 0x388(0x08)
	struct UImage* Divider_top; // 0x390(0x08)
	struct UHorizontalBox* HB_BriefingRigsButtons; // 0x398(0x08)
	struct UWBP_SectionHeaderBlack_C* Header_Armor; // 0x3a0(0x08)
	struct UWBP_SectionHeaderBlack_C* Header_ASS; // 0x3a8(0x08)
	struct UWBP_SectionHeaderBlack_C* Header_Companion; // 0x3b0(0x08)
	struct UWBP_SectionHeaderBlack_C* Header_Items; // 0x3b8(0x08)
	struct UWBP_RichTextLabel_C* Header_SelectWeapon; // 0x3c0(0x08)
	struct UWBP_RichTextLabel_C* Header_SelectWeaponType; // 0x3c8(0x08)
	struct UWBP_SectionHeaderBlack_C* Header_Weapons; // 0x3d0(0x08)
	struct UImage* Image_6; // 0x3d8(0x08)
	struct UImage* Image_7; // 0x3e0(0x08)
	struct UImage* Image_50; // 0x3e8(0x08)
	struct UImage* Image_96; // 0x3f0(0x08)
	struct UScrollBox* ItemSelectionItems; // 0x3f8(0x08)
	struct UWBP_Rigs_ItemButton_C* ItemSlot1; // 0x400(0x08)
	struct UWBP_Rigs_ItemButton_C* ItemSlot2; // 0x408(0x08)
	struct UWBP_Rigs_ItemButton_C* ItemSlot3; // 0x410(0x08)
	struct UWBP_RichTextLabel_C* Label_ItemCategorySlotInfo; // 0x418(0x08)
	struct UWBP_RichTextLabel_C* Label_ItemSelectionHeader; // 0x420(0x08)
	struct UWBP_RichTextLabel_C* Label_ItemSelectionHeader_4; // 0x428(0x08)
	struct UWBP_RichTextLabel_C* Label_ItemSelectionHeader_7; // 0x430(0x08)
	struct UWBP_RichTextLabel_C* Label_ItemSlotInfo; // 0x438(0x08)
	struct UWBP_RichTextLabel_C* Label_Loadoutname; // 0x440(0x08)
	struct UWidgetSwitcher* MainSwitcher; // 0x448(0x08)
	struct UMenuAnchor* MenuAnchor_Accessories_2; // 0x450(0x08)
	struct UMenuAnchor* MenuAnchor_AccessoryCategories; // 0x458(0x08)
	struct UMenuAnchor* MenuAnchor_ArmorBadges; // 0x460(0x08)
	struct UMenuAnchor* MenuAnchor_ArmorModCategories_2; // 0x468(0x08)
	struct UMenuAnchor* MenuAnchor_ArmorSetButton; // 0x470(0x08)
	struct UMenuAnchor* MenuAnchor_ArmorSets; // 0x478(0x08)
	struct UMenuAnchor* MenuAnchor_ArmorSkins; // 0x480(0x08)
	struct UMenuAnchor* MenuAnchor_AssCompanion; // 0x488(0x08)
	struct UMenuAnchor* MenuAnchor_AssList; // 0x490(0x08)
	struct UMenuAnchor* MenuAnchor_CharacterCustomization; // 0x498(0x08)
	struct UMenuAnchor* MenuAnchor_DroneAbilityButtons; // 0x4a0(0x08)
	struct UMenuAnchor* MenuAnchor_DroneAbilityList; // 0x4a8(0x08)
	struct UMenuAnchor* MenuAnchor_ItemList; // 0x4b0(0x08)
	struct UMenuAnchor* MenuAnchor_Items; // 0x4b8(0x08)
	struct UMenuAnchor* MenuAnchor_Primary; // 0x4c0(0x08)
	struct UMenuAnchor* MenuAnchor_Secondary; // 0x4c8(0x08)
	struct UMenuAnchor* MenuAnchor_VoiceSelection; // 0x4d0(0x08)
	struct UMenuAnchor* MenuAnchor_WeaponPopover; // 0x4d8(0x08)
	struct UWBP_RichTextLabel_C* NumRigs; // 0x4e0(0x08)
	struct UWBP_RichTextLabel_C* ObjectivesTitle; // 0x4e8(0x08)
	struct UCanvasPanel* Panel_CharacterArea; // 0x4f0(0x08)
	struct UCanvasPanel* Panel_CustomizationButtons; // 0x4f8(0x08)
	struct UScrollBox* RigList; // 0x500(0x08)
	struct UThrobber* SaveIndicator; // 0x508(0x08)
	struct UScrollBox* SB_AccessoryCategoriesList; // 0x510(0x08)
	struct UScrollBox* SB_AccessoryItemsList; // 0x518(0x08)
	struct UScrollBox* SB_ArmorBadgesList; // 0x520(0x08)
	struct UScrollBox* SB_ArmorModCategories; // 0x528(0x08)
	struct UScrollBox* SB_ArmorSetList; // 0x530(0x08)
	struct UScrollBox* SB_ArmorSkinList; // 0x538(0x08)
	struct UScrollBox* SB_ASSList; // 0x540(0x08)
	struct UScrollBox* SB_CharacterCustomizationCategories; // 0x548(0x08)
	struct UScrollBox* SB_DroneAbility; // 0x550(0x08)
	struct UScrollBox* SB_ItemCategories; // 0x558(0x08)
	struct UScrollBox* SB_VoiceSelection; // 0x560(0x08)
	struct UScrollBox* SB_WeaponCategoriesPrimary; // 0x568(0x08)
	struct UScrollBox* SB_WeaponCategoriesSecondary; // 0x570(0x08)
	struct UScrollBox* SB_Weapons; // 0x578(0x08)
	struct UVerticalBox* Screen_AccessoryCategorySelection; // 0x580(0x08)
	struct UVerticalBox* Screen_AccessoryItemSelection; // 0x588(0x08)
	struct UVerticalBox* Screen_ArmorBadgeSelection; // 0x590(0x08)
	struct UVerticalBox* Screen_ArmorModCategorySelection; // 0x598(0x08)
	struct UVerticalBox* Screen_ArmorSetSelection; // 0x5a0(0x08)
	struct UVerticalBox* Screen_ArmorSkinSelection; // 0x5a8(0x08)
	struct UVerticalBox* Screen_ASSSelection; // 0x5b0(0x08)
	struct UVerticalBox* Screen_CharacterCustomization; // 0x5b8(0x08)
	struct UVerticalBox* Screen_DroneAbilitySelection; // 0x5c0(0x08)
	struct UVerticalBox* Screen_FaceSelection; // 0x5c8(0x08)
	struct UVerticalBox* Screen_ItemCategorySelect; // 0x5d0(0x08)
	struct UVerticalBox* Screen_ItemSelection; // 0x5d8(0x08)
	struct UVerticalBox* Screen_LoadoutContents; // 0x5e0(0x08)
	struct UVerticalBox* Screen_VoiceSelection; // 0x5e8(0x08)
	struct UVerticalBox* Screen_WeaponCategorySelect; // 0x5f0(0x08)
	struct UVerticalBox* Screen_WeaponSelection; // 0x5f8(0x08)
	struct UVerticalBox* Section_ASS; // 0x600(0x08)
	struct UVerticalBox* Section_Companion; // 0x608(0x08)
	struct UVerticalBox* Section_Items; // 0x610(0x08)
	struct UWidgetSwitcher* SwitcherBriefingRigs; // 0x618(0x08)
	struct UWidgetSwitcher* SwitcherWeaponCategory; // 0x620(0x08)
	struct UVerticalBox* VB_Briefing; // 0x628(0x08)
	struct UVerticalBox* VB_Objectives; // 0x630(0x08)
	struct UVerticalBox* VB_RightPanel; // 0x638(0x08)
	struct UVerticalBox* VB_Rigs; // 0x640(0x08)
	struct UWrapBox* WB_Faces; // 0x648(0x08)
	struct UWBP_Map_C* WBP_Map; // 0x650(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel_2; // 0x658(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel_3; // 0x660(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel_4; // 0x668(0x08)
	struct UWBP_Rigs_AssButton_C* WBP_Rigs_AssButton; // 0x670(0x08)
	struct UWBP_Rigs_AssButton_C* WBP_Rigs_AssButton_2; // 0x678(0x08)
	struct UWBP_Rigs_AssButton_C* WBP_Rigs_AssButton_3; // 0x680(0x08)
	struct UWBP_Rigs_CharacterCustomizationListItem_C* WBP_Rigs_CharacterCustomization_Face; // 0x688(0x08)
	struct UWBP_Rigs_CharacterCustomizationListItem_C* WBP_Rigs_CharacterCustomization_Voice; // 0x690(0x08)
	struct UWBP_Rigs_VoiceListItem_C* WBP_Rigs_VoiceListItem; // 0x698(0x08)
	struct UWBP_Rigs_VoiceListItem_C* WBP_Rigs_VoiceListItem_2; // 0x6a0(0x08)
	struct UWBP_Rigs_WeaponSettingsButton_C* WBP_Rigs_WeaponSettingsButton_Primary; // 0x6a8(0x08)
	struct UWBP_Rigs_WeaponSettingsButton_C* WBP_Rigs_WeaponSettingsButton_Secondary; // 0x6b0(0x08)
	struct UWBP_Rigs_WeaponButton_C* WeaponPrimary; // 0x6b8(0x08)
	struct UWBP_Rigs_WeaponButton_C* WeaponSecondary; // 0x6c0(0x08)
	int32_t MaxRigs; // 0x6c8(0x04)
	char pad_6CC[0x4]; // 0x6cc(0x04)
	struct FHWLoadoutData LoadoutData; // 0x6d0(0x88)
	struct FHWLoadoutData OrigLoadoutData; // 0x758(0x88)
	struct FName HoveredArmorSetId; // 0x7e0(0x08)
	bool SelectingPrimaryWeapon; // 0x7e8(0x01)
	char pad_7E9[0x7]; // 0x7e9(0x07)
	struct UWBP_Rigs_WeaponListItem_C* HoveredWeaponItem; // 0x7f0(0x08)
	char CurrentAssSlot; // 0x7f8(0x01)
	char pad_7F9[0x3]; // 0x7f9(0x03)
	int32_t CurrentAssSlotIndex; // 0x7fc(0x04)
	struct FHWLoadoutData NewLoadoutData; // 0x800(0x88)
	bool IsInMainView; // 0x888(0x01)
	char pad_889[0x7]; // 0x889(0x07)
	struct TArray<struct FString> CraftedWeaponsOneHanded; // 0x890(0x10)
	struct TArray<struct FString> CraftedWeaponsAll; // 0x8a0(0x10)
	struct UHWGameData* Data; // 0x8b0(0x08)
	struct UHWPlayerProfile* PlayerProfile; // 0x8b8(0x08)
	struct FName HoveredItemId; // 0x8c0(0x08)
	bool IsDirty; // 0x8c8(0x01)
	bool IsSaving; // 0x8c9(0x01)
	bool IsInPrematch; // 0x8ca(0x01)
	char pad_8CB[0x1]; // 0x8cb(0x01)
	struct FName HoveredAssId; // 0x8cc(0x08)
	struct FName HoveredDroneAbilityId; // 0x8d4(0x08)
	char pad_8DC[0x4]; // 0x8dc(0x04)
	struct FMulticastInlineDelegate OnLoadoutUpdated; // 0x8e0(0x10)
	struct UWBP_Armory2_Popup_Weapon_C* WeaponPopup; // 0x8f0(0x08)
	bool CreateNextLoadoutAsEmpty; // 0x8f8(0x01)
	char pad_8F9[0x7]; // 0x8f9(0x07)
	struct TArray<struct UWidget*> MenuStack; // 0x900(0x10)
	bool InWeaponFlow; // 0x910(0x01)
	char pad_911[0x7]; // 0x911(0x07)
	struct FTimerHandle WeaponPopOverTimer; // 0x918(0x08)
	struct UWBP_Rigs_WeaponPopover_C* WeaponPopOverWidget; // 0x920(0x08)
	struct TMap<struct FString, struct UWBP_Rigs_RigListItem_C*> PopulatedRigListItems; // 0x928(0x50)
	bool DuplicateRig; // 0x978(0x01)
	char pad_979[0x7]; // 0x979(0x07)
	struct FString DuplicatingRigName; // 0x980(0x10)
	bool RefreshSelectionAfterLoad; // 0x990(0x01)

	void GetWeaponIdsSortedByName(struct TArray<struct FString> ItemIDs, struct TMap<struct FString, struct FString> WeaponIdByName); // Function WBP_Rigs.WBP_Rigs_C.GetWeaponIdsSortedByName // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x13c4ca0
	void OnArmorSetListHovered(struct FName ArmorSetId, bool IsHover); // Function WBP_Rigs.WBP_Rigs_C.OnArmorSetListHovered // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void IsInTutorial(bool Result); // Function WBP_Rigs.WBP_Rigs_C.IsInTutorial // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x13c4ca0
	void PlayEquipingSound(enum class EHWInventoryItemType Type, struct FName ArmorSetId); // Function WBP_Rigs.WBP_Rigs_C.PlayEquipingSound // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
