// WidgetBlueprintGeneratedClass WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C
// Size: 0x622 (Inherited: 0x268)
struct UWBP_ShopItem_DetailInfo_C : UHWWidgetBase {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x268(0x08)
	struct UWBP_RichTextLabel_C* Ability1_Description; // 0x270(0x08)
	struct UImage* Ability1_Icon; // 0x278(0x08)
	struct UWBP_RichTextLabel_C* Ability1_Title; // 0x280(0x08)
	struct UWBP_RichTextLabel_C* Ability2_Description; // 0x288(0x08)
	struct UImage* Ability2_Icon; // 0x290(0x08)
	struct UWBP_RichTextLabel_C* Ability2_Title; // 0x298(0x08)
	struct UVerticalBox* ArmorParams; // 0x2a0(0x08)
	struct UWBP_Rigs_ArmorSetPopover_AssCount_C* AssCount_2; // 0x2a8(0x08)
	struct USizeBox* BundleBox; // 0x2b0(0x08)
	struct UImage* BundleHeader_BG; // 0x2b8(0x08)
	struct UImage* BundleHeader_BG_2; // 0x2c0(0x08)
	struct UWBP_RichTextLabel_C* BundleItemsTitle; // 0x2c8(0x08)
	struct UTileView* BundleTileView; // 0x2d0(0x08)
	struct UHorizontalBox* Buy; // 0x2d8(0x08)
	struct USizeBox* BuyBox; // 0x2e0(0x08)
	struct UWBP_MainButton_C* BuyButton; // 0x2e8(0x08)
	struct UWidgetSwitcher* BuySwitcher; // 0x2f0(0x08)
	struct UVerticalBox* CompanionDrone; // 0x2f8(0x08)
	struct UWidgetSwitcher* ContentSwitcher; // 0x300(0x08)
	struct USizeBox* CurrencyBox; // 0x308(0x08)
	struct UOverlay* CurrencyDescription; // 0x310(0x08)
	struct UWBP_RichTextLabel_C* CurrencyInstructionTtile; // 0x318(0x08)
	struct UListView* CurrencyListView; // 0x320(0x08)
	struct UVerticalBox* Description; // 0x328(0x08)
	struct UWBP_RichTextLabel_C* DescriptionText; // 0x330(0x08)
	struct UWidgetSwitcher* DetailSwitcher; // 0x338(0x08)
	struct UImage* GenericImage; // 0x340(0x08)
	struct UWBP_RichTextLabel_C* GenericText; // 0x348(0x08)
	struct UOverlay* GenericWithImage; // 0x350(0x08)
	struct UUniformGridPanel* GridViewPanel; // 0x358(0x08)
	struct UImage* HistoryImage_2; // 0x360(0x08)
	struct UImage* Icon_FireMode; // 0x368(0x08)
	struct UImage* Image_714; // 0x370(0x08)
	struct UWBP_RichTextLabel_C* InfoTitleText; // 0x378(0x08)
	struct UWidgetSwitcher* Item_DetailSwitcher; // 0x380(0x08)
	struct USizeBox* ItemBox; // 0x388(0x08)
	struct UWBP_RichTextLabel_C* Label_AimStability; // 0x390(0x08)
	struct UWBP_RichTextLabel_C* Label_Durability_Armor_2; // 0x398(0x08)
	struct UWBP_RichTextLabel_C* Label_MagSize; // 0x3a0(0x08)
	struct UWBP_RichTextLabel_C* Label_MaxRange; // 0x3a8(0x08)
	struct UWBP_RichTextLabel_C* Label_Rarity; // 0x3b0(0x08)
	struct UWBP_RichTextLabel_C* Label_ReloadSpeed; // 0x3b8(0x08)
	struct UWBP_RichTextLabel_C* Label_RPM; // 0x3c0(0x08)
	struct UWBP_RichTextLabel_C* Label_Sight; // 0x3c8(0x08)
	struct UWBP_RichTextLabel_C* Label_WeaponType; // 0x3d0(0x08)
	struct UImage* Line_3; // 0x3d8(0x08)
	struct USizeBox* Meta; // 0x3e0(0x08)
	struct UWBP_ShopItem_OfferTag_C* Meta_Category; // 0x3e8(0x08)
	struct UWBP_ShopItem_OfferTag_C* Meta_Corporation; // 0x3f0(0x08)
	struct UWBP_ShopItem_OfferTag_C* Meta_Rarity; // 0x3f8(0x08)
	struct UWBP_ShopItem_OfferTag_C* Meta_Weapon; // 0x400(0x08)
	struct UWidgetSwitcher* MetaSwitcher; // 0x408(0x08)
	struct UHorizontalBox* MetaTags; // 0x410(0x08)
	struct UWBP_RichTextLabel_C* MetaText; // 0x418(0x08)
	struct UNamedSlot* NamedSlot; // 0x420(0x08)
	struct UNamedSlot* NamedSlot_2; // 0x428(0x08)
	struct UNamedSlot* NamedSlot_3; // 0x430(0x08)
	struct UNamedSlot* NamedSlot_4; // 0x438(0x08)
	struct UNamedSlot* NamedSlot_5; // 0x440(0x08)
	struct UNamedSlot* NamedSlot_48; // 0x448(0x08)
	struct UImage* NaviBar_Line; // 0x450(0x08)
	struct USizeBox* OutOfStockBox; // 0x458(0x08)
	struct UWBP_Armory2_Parameter_Bar_C* Param_AimStability; // 0x460(0x08)
	struct UWBP_Armory2_Parameter_Bar_C* Param_MaxRange; // 0x468(0x08)
	struct UWBP_Armory2_Parameter_Bar_C* Param_ReloadSpeed; // 0x470(0x08)
	struct UWBP_Armory2_Parameter_Group_C* PartParameter1; // 0x478(0x08)
	struct UWBP_Armory2_Parameter_Group_C* PartParameter2; // 0x480(0x08)
	struct UVerticalBox* PartParameters; // 0x488(0x08)
	struct UImage* RarityImage; // 0x490(0x08)
	struct UVerticalBox* ScopeInfo; // 0x498(0x08)
	struct USizeBox* TileViewPanel; // 0x4a0(0x08)
	struct UWBP_RichTextLabel_C* TitleText; // 0x4a8(0x08)
	struct UWBP_RichTextLabel_C* UnavailableText; // 0x4b0(0x08)
	struct UWBP_Rigs_ComparisonBar_C* ValueHitpoints_2; // 0x4b8(0x08)
	struct UVerticalBox* VB_ItemSlots_Current_2; // 0x4c0(0x08)
	struct UVerticalBox* VB_ItemSlots_This_3; // 0x4c8(0x08)
	struct UVerticalBox* VB_ItemSlots_This_Parent_3; // 0x4d0(0x08)
	struct UWBP_RichTextLabel_C* VideoHeader; // 0x4d8(0x08)
	struct UWBP_Box_C* WBP_Box; // 0x4e0(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel_12; // 0x4e8(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel_170; // 0x4f0(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel_287; // 0x4f8(0x08)
	struct UWBP_Shop_Item_PriceTag_C* WBP_Shop_Item_PriceTag; // 0x500(0x08)
	struct UWBP_ShopCurrency_DetailItem_C* WBP_ShopCurrency_DetailItem; // 0x508(0x08)
	struct UWBP_ShopCurrency_DetailItem_C* WBP_ShopCurrency_DetailItem_2; // 0x510(0x08)
	struct UWBP_ShopCurrency_DetailItem_C* WBP_ShopCurrency_DetailItem_3; // 0x518(0x08)
	struct UWBP_ShopCurrency_DetailItem_C* WBP_ShopCurrency_DetailItem_4; // 0x520(0x08)
	struct UWBP_ShopItem_OfferTag_C* WBP_ShopItem_OfferTag; // 0x528(0x08)
	struct UWBP_Weapon_ChartView_C* WBP_Weapon_ChartView; // 0x530(0x08)
	struct UWBP_Weapon_StatsView_C* WBP_Weapon_StatsView; // 0x538(0x08)
	struct UVerticalBox* WeaponParameters; // 0x540(0x08)
	struct UWidgetSwitcher* WeaponParmsViewSwitcher; // 0x548(0x08)
	struct FHWShopItem ItemData; // 0x550(0x78)
	struct FText ItemName; // 0x5c8(0x18)
	struct FString SubsectionId; // 0x5e0(0x10)
	struct FString CampaignId; // 0x5f0(0x10)
	int32_t ItemIndex; // 0x600(0x04)
	enum class BPE_ShopItemType ItemType; // 0x604(0x01)
	bool RemoveNotification; // 0x605(0x01)
	bool DoRefreshPageContent; // 0x606(0x01)
	bool IsBundlePreview; // 0x607(0x01)
	struct TArray<struct FHWRewardBoxesData> BoxRewardsData; // 0x608(0x10)
	struct FTimerHandle ShowWeaponStatsTimer; // 0x618(0x08)
	enum class EHWFaction ItemFaction; // 0x620(0x01)
	bool CachedBuyButtonEnabledState; // 0x621(0x01)

	void SetMaterialsDescription(); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.SetMaterialsDescription // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void SetIconforCurrencyBox(int32_t KPI_Index, enum class BPE_ShopItemType Item_Type, struct FText Description, struct UTexture2D* Icon); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.SetIconforCurrencyBox // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x13c4ca0
	void SetWeaponParams(struct UHWWeaponParameters* WeaponParams, struct UWBP_RichTextLabel_C* Label, enum class EHWCraftingParameter Type, struct UProgressBar* ProgressBar); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.SetWeaponParams // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void SetWeaponData(struct FName ReceiverId, struct UHWWeaponParameters* WeaponParameters); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.SetWeaponData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void SetArmorDurability(struct UWBP_RichTextLabel_C* Label, struct UWBP_Rigs_ComparisonBar_C* ProgressBar, int32_t CurrentHP, int32_t ComparisonHP); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.SetArmorDurability // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void PopulateArmorItemSlots(struct FHWArmorSetBaseData Data, struct UPanelWidget* Container); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.PopulateArmorItemSlots // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void SetArmorParameters(struct FName ArmorSetId); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.SetArmorParameters // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void Set Offer Tag(); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.Set Offer Tag // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void SetBasicContent(struct FHWShopItem ShopItem, struct FString SubsectionId, struct FString CampaignId); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.SetBasicContent // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void SetExpired(); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.SetExpired // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void SetMeta(); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.SetMeta // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void SetBlueprintCodeParameters(); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.SetBlueprintCodeParameters // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void IsPurchaseable(bool Purchaseable, int32_t AmountShort); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.IsPurchaseable // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x13c4ca0
	void SetCurrencyContent(); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.SetCurrencyContent // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void IsCurrencyInfo(bool CurrencyInfo); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.IsCurrencyInfo // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x13c4ca0
	void SetCurrencyParameters(bool IsInBundle); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.SetCurrencyParameters // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void SetPrice(); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.SetPrice // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void SetItemName(); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.SetItemName // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void SetBundleContent(struct FHWShopItem Item, struct FString SubsectionId, struct FString CampaignId); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.SetBundleContent // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void SetWeaponInfo(struct FName ID, bool IsWeapon, enum class EHWRarity PartRarity, enum class EHWWeaponPartType PartType); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.SetWeaponInfo // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void SetDetailsContent(); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.SetDetailsContent // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void SetContent(struct FHWShopItem ItemData, struct FString SubsectionId, struct FString CampaignId, int32_t ItemIndex, bool IsBundlePreview); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.SetContent // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void PreConstruct(bool IsDesignTime); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x13c4ca0
	void Construct(); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x13c4ca0
	void BndEvt__BuyButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(struct UWBP_MainButton_C* Button); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.BndEvt__BuyButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x13c4ca0
	void OptionClicked(bool Result); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.OptionClicked // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void InitiatePurchase(); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.InitiatePurchase // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void RMTFinished(struct FHWBuyShopItemResult Result); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.RMTFinished // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void NonRMTSuccess(struct FHWResponseBase Response); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.NonRMTSuccess // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void NonRMTFailed(enum class EHWErrorMessage ErrorMessage); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.NonRMTFailed // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void OnPlayerProgressionChanged(struct FHWPlayerProgression Data); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.OnPlayerProgressionChanged // (BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x13c4ca0
	void RunSuccessfulFlow(); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.RunSuccessfulFlow // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void ShowVouchersInShop(bool Result); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.ShowVouchersInShop // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void OnPlayerMissionChanged(struct FHWPlayerMission Data); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.OnPlayerMissionChanged // (BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x13c4ca0
	void ErrorClosed(bool Result); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.ErrorClosed // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void OnPlayerInventoryChanged(struct FHWPlayerInventory Data); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.OnPlayerInventoryChanged // (BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x13c4ca0
	void OnPlayerStatsChanged(struct FHWPlayerStats Data); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.OnPlayerStatsChanged // (BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x13c4ca0
	void CollectRewardError(enum class EHWErrorMessage ErrorMessage); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.CollectRewardError // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void RewardsCollected(bool Result); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.RewardsCollected // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void FetchedRewards(struct FHWFetchRewardsResponse Response); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.FetchedRewards // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void CollectedRewards(struct FHWProfileWithCollectedRewardsResponse Response); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.CollectedRewards // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void Error(enum class EHWErrorMessage ErrorMessage); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.Error // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void OnPlayerDetailsChanged(struct FHWPlayerDetails Data); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.OnPlayerDetailsChanged // (BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x13c4ca0
	void ShowWeaponStats(); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.ShowWeaponStats // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void HideWeaponStats(); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.HideWeaponStats // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void SwitchWeaponView(bool ShowStatsView); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.SwitchWeaponView // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void SwitchToWeaponStatsView(); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.SwitchToWeaponStatsView // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void ListenInputForWeaponParamsView(); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.ListenInputForWeaponParamsView // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void ExecuteUbergraph_WBP_ShopItem_DetailInfo(int32_t EntryPoint); // Function WBP_ShopItem_DetailInfo.WBP_ShopItem_DetailInfo_C.ExecuteUbergraph_WBP_ShopItem_DetailInfo // (Final|UbergraphFunction|HasDefaults) // @ game+0x13c4ca0
};

