// WidgetBlueprintGeneratedClass WBP_ShopLayout_Base.WBP_ShopLayout_Base_C
// Size: 0x62c (Inherited: 0x268)
struct UWBP_ShopLayout_Base_C : UHWWidgetBase {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x268(0x08)
	struct UWidgetSwitcher* 1Item; // 0x270(0x08)
	struct UWidgetSwitcher* 2Items; // 0x278(0x08)
	struct UWidgetSwitcher* 3Items; // 0x280(0x08)
	struct UWidgetSwitcher* 4Items; // 0x288(0x08)
	struct UWidgetSwitcher* 5Items; // 0x290(0x08)
	struct UWidgetSwitcher* 6Items; // 0x298(0x08)
	struct UWidgetSwitcher* 7Items; // 0x2a0(0x08)
	struct UWidgetSwitcher* 8_Items; // 0x2a8(0x08)
	struct UWidgetSwitcher* 9_Items; // 0x2b0(0x08)
	struct UNamedSlot* Large; // 0x2b8(0x08)
	struct UNamedSlot* Large1_1_2; // 0x2c0(0x08)
	struct UNamedSlot* Large_2_1_2; // 0x2c8(0x08)
	struct UNamedSlot* Large_2_1_3; // 0x2d0(0x08)
	struct UNamedSlot* Large_3_2_2; // 0x2d8(0x08)
	struct UNamedSlot* Large_4_1_2; // 0x2e0(0x08)
	struct UNamedSlot* Large_4_2_2; // 0x2e8(0x08)
	struct UNamedSlot* Large_4_4_2; // 0x2f0(0x08)
	struct UNamedSlot* Large_5_1_2; // 0x2f8(0x08)
	struct UNamedSlot* Large_6_1_2; // 0x300(0x08)
	struct UWidgetSwitcher* LayoutSwitcher; // 0x308(0x08)
	struct UNamedSlot* Medium_2_3_3; // 0x310(0x08)
	struct UNamedSlot* Medium_3_1_2; // 0x318(0x08)
	struct UNamedSlot* Medium_3_1_3; // 0x320(0x08)
	struct UNamedSlot* Medium_3_1_4; // 0x328(0x08)
	struct UNamedSlot* Medium_3_2_3; // 0x330(0x08)
	struct UNamedSlot* Medium_4_1_3; // 0x338(0x08)
	struct UNamedSlot* Medium_4_3_2; // 0x340(0x08)
	struct UNamedSlot* Medium_4_3_3; // 0x348(0x08)
	struct UNamedSlot* Medium_5_2_2; // 0x350(0x08)
	struct UNamedSlot* Medium_6_2_2; // 0x358(0x08)
	struct UNamedSlot* Medium_9_1_2; // 0x360(0x08)
	struct UNamedSlot* Small1; // 0x368(0x08)
	struct UNamedSlot* Small2; // 0x370(0x08)
	struct UNamedSlot* Small3; // 0x378(0x08)
	struct UNamedSlot* Small4; // 0x380(0x08)
	struct UNamedSlot* Small5; // 0x388(0x08)
	struct UNamedSlot* Small6; // 0x390(0x08)
	struct UNamedSlot* Small_4_1_4; // 0x398(0x08)
	struct UNamedSlot* Small_4_1_5; // 0x3a0(0x08)
	struct UNamedSlot* Small_4_5_4; // 0x3a8(0x08)
	struct UNamedSlot* Small_4_5_5; // 0x3b0(0x08)
	struct UNamedSlot* Small_4_6_4; // 0x3b8(0x08)
	struct UNamedSlot* Small_4_6_5; // 0x3c0(0x08)
	struct UNamedSlot* Small_5_1_5; // 0x3c8(0x08)
	struct UNamedSlot* Small_5_1_6; // 0x3d0(0x08)
	struct UNamedSlot* Small_6_1_4; // 0x3d8(0x08)
	struct UNamedSlot* Small_6_1_5; // 0x3e0(0x08)
	struct UNamedSlot* Small_6_1_6; // 0x3e8(0x08)
	struct UNamedSlot* Small_6_1_7; // 0x3f0(0x08)
	struct UNamedSlot* Small_6_2_6; // 0x3f8(0x08)
	struct UNamedSlot* Small_6_2_7; // 0x400(0x08)
	struct UNamedSlot* Small_6_3_2; // 0x408(0x08)
	struct UNamedSlot* Small_6_3_3; // 0x410(0x08)
	struct UNamedSlot* Small_6_3_4; // 0x418(0x08)
	struct UNamedSlot* Small_6_3_5; // 0x420(0x08)
	struct UNamedSlot* Small_6_3_6; // 0x428(0x08)
	struct UNamedSlot* Small_6_3_7; // 0x430(0x08)
	struct UNamedSlot* Small_9_1_3; // 0x438(0x08)
	struct UNamedSlot* Small_9_1_4; // 0x440(0x08)
	struct UNamedSlot* Small_9_1_5; // 0x448(0x08)
	struct UNamedSlot* Small_9_1_6; // 0x450(0x08)
	struct UNamedSlot* Small_9_1_7; // 0x458(0x08)
	struct UNamedSlot* Small_9_1_8; // 0x460(0x08)
	struct UNamedSlot* Small_9_1_9; // 0x468(0x08)
	struct UNamedSlot* Small_9_1_10; // 0x470(0x08)
	struct UNamedSlot* SmallH_3_4_3; // 0x478(0x08)
	struct UNamedSlot* SmallH_3_4_4; // 0x480(0x08)
	struct UNamedSlot* SmallH_4_2_3; // 0x488(0x08)
	struct UNamedSlot* SmallH_4_2_4; // 0x490(0x08)
	struct UNamedSlot* SmallH_4_6_3; // 0x498(0x08)
	struct UNamedSlot* SmallV_3_2_4; // 0x4a0(0x08)
	struct UNamedSlot* SmallV_3_3_3; // 0x4a8(0x08)
	struct UNamedSlot* SmallV_3_3_4; // 0x4b0(0x08)
	struct UNamedSlot* SmallV_4_2_5; // 0x4b8(0x08)
	struct UNamedSlot* SmallV_4_3_4; // 0x4c0(0x08)
	struct UNamedSlot* SmallV_4_3_5; // 0x4c8(0x08)
	struct UNamedSlot* SmallV_4_4_3; // 0x4d0(0x08)
	struct UNamedSlot* SmallV_4_4_4; // 0x4d8(0x08)
	struct UNamedSlot* SmallV_4_4_5; // 0x4e0(0x08)
	struct UNamedSlot* SmallV_4_5_3; // 0x4e8(0x08)
	struct UNamedSlot* SmallV_5_1_3; // 0x4f0(0x08)
	struct UNamedSlot* SmallV_5_1_4; // 0x4f8(0x08)
	struct UNamedSlot* SmallV_5_2_3; // 0x500(0x08)
	struct UNamedSlot* SmallV_5_2_4; // 0x508(0x08)
	struct UNamedSlot* SmallV_5_2_5; // 0x510(0x08)
	struct UNamedSlot* SmallV_5_2_6; // 0x518(0x08)
	struct UNamedSlot* SmallV_6_1_3; // 0x520(0x08)
	struct UNamedSlot* SmallV_6_2_3; // 0x528(0x08)
	struct UNamedSlot* SmallV_6_2_4; // 0x530(0x08)
	struct UNamedSlot* SmallV_6_2_5; // 0x538(0x08)
	struct UNamedSlot* XLarge_2_3_2; // 0x540(0x08)
	struct UNamedSlot* XLarge_3_3_2; // 0x548(0x08)
	struct UNamedSlot* XLarge_3_4_2; // 0x550(0x08)
	struct UNamedSlot* XLarge_4_5_2; // 0x558(0x08)
	struct UNamedSlot* XLarge_4_6_2; // 0x560(0x08)
	struct TArray<struct UNamedSlot*> ShopItems; // 0x568(0x10)
	struct UGridPanel* GridPanel; // 0x578(0x08)
	struct FBP_ShopSubsectionWithCampaignId SubsectionData; // 0x580(0x68)
	struct TArray<struct UWBP_ShopItem_New_C*> ItemWidgets; // 0x5e8(0x10)
	struct FString Layout; // 0x5f8(0x10)
	struct FString SubsectionId; // 0x608(0x10)
	struct FString CampaignId; // 0x618(0x10)
	int32_t StartingItemIndexInSubsection; // 0x628(0x04)

	void CreateShopItems(struct TArray<struct FString> SubsectionItemSizes); // Function WBP_ShopLayout_Base.WBP_ShopLayout_Base_C.CreateShopItems // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void SetContent(); // Function WBP_ShopLayout_Base.WBP_ShopLayout_Base_C.SetContent // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void UpdateSlots(); // Function WBP_ShopLayout_Base.WBP_ShopLayout_Base_C.UpdateSlots // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void PreConstruct(bool IsDesignTime); // Function WBP_ShopLayout_Base.WBP_ShopLayout_Base_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x13c4ca0
	void Construct(); // Function WBP_ShopLayout_Base.WBP_ShopLayout_Base_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x13c4ca0
	void ExecuteUbergraph_WBP_ShopLayout_Base(int32_t EntryPoint); // Function WBP_ShopLayout_Base.WBP_ShopLayout_Base_C.ExecuteUbergraph_WBP_ShopLayout_Base // (Final|UbergraphFunction) // @ game+0x13c4ca0
};

