// WidgetBlueprintGeneratedClass WBP_RoundResults2_Missions_Title.WBP_RoundResults2_Missions_Title_C
// Size: 0x2a0 (Inherited: 0x260)
struct UWBP_RoundResults2_Missions_Title_C : UUserWidget {
	struct UImage* StarIcon; // 0x260(0x08)
	struct UImage* StarIcon_2; // 0x268(0x08)
	struct UImage* StarIcon_3; // 0x270(0x08)
	struct UImage* StarIcon_4; // 0x278(0x08)
	struct UImage* StarIcon_5; // 0x280(0x08)
	struct UImage* StarIcon_6; // 0x288(0x08)
	struct UWBP_Box_C* WBP_Box; // 0x290(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel; // 0x298(0x08)
};

