// WidgetBlueprintGeneratedClass WBP_RoundResults2_Weapons.WBP_RoundResults2_Weapons_C
// Size: 0x2c8 (Inherited: 0x260)
struct UWBP_RoundResults2_Weapons_C : UUserWidget {
	struct UVerticalBox* FamiliarityBlock; // 0x260(0x08)
	struct UTextBlock* FamiliarityCurrentLevelLabel; // 0x268(0x08)
	struct UTextBlock* FamiliarityNextLevelLabel; // 0x270(0x08)
	struct UProgressBar* FamiliarityProgressBar_2; // 0x278(0x08)
	struct UImage* Image_155; // 0x280(0x08)
	struct UWBP_RichTextLabel_C* PlusPoints; // 0x288(0x08)
	struct UWBP_Box_C* WBP_Box; // 0x290(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel_6; // 0x298(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel_7; // 0x2a0(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel_128; // 0x2a8(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel_215; // 0x2b0(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel_525; // 0x2b8(0x08)
	struct UWBP_RichTextLabel_C* WeaponLevel; // 0x2c0(0x08)
};

