// WidgetBlueprintGeneratedClass WBP_GamepadBindings.WBP_GamepadBindings_C
// Size: 0x610 (Inherited: 0x260)
struct UWBP_GamepadBindings_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UImage* ControllerImage; // 0x268(0x08)
	struct UImage* ControllerImage_2; // 0x270(0x08)
	struct UImage* ControllerImage_3; // 0x278(0x08)
	struct UImage* ControllerImage_4; // 0x280(0x08)
	struct UWBP_RichTextLabel_C* Disclaimer; // 0x288(0x08)
	struct UWidgetSwitcher* GamepadTypeSwitcher; // 0x290(0x08)
	struct UCanvasPanel* PlaystationGamepad; // 0x298(0x08)
	struct UImage* PsButtonHighlighterDpadDown; // 0x2a0(0x08)
	struct UImage* PsButtonHighlighterDpadLeft; // 0x2a8(0x08)
	struct UImage* PsButtonHighlighterDpadRight; // 0x2b0(0x08)
	struct UImage* PsButtonHighlighterDpadUp; // 0x2b8(0x08)
	struct UImage* PsButtonHighlighterFaceButtonBottom; // 0x2c0(0x08)
	struct UImage* PsButtonHighlighterFaceButtonLeft; // 0x2c8(0x08)
	struct UImage* PsButtonHighlighterFaceButtonRight; // 0x2d0(0x08)
	struct UImage* PsButtonHighlighterFaceButtonTop; // 0x2d8(0x08)
	struct UImage* PsButtonHighlighterLeftShoulder; // 0x2e0(0x08)
	struct UImage* PsButtonHighlighterLeftThumbstick; // 0x2e8(0x08)
	struct UImage* PsButtonHighlighterMenuButton; // 0x2f0(0x08)
	struct UImage* PsButtonHighlighterOptionsButton; // 0x2f8(0x08)
	struct UImage* PsButtonHighlighterRightShoulder; // 0x300(0x08)
	struct UImage* PsButtonHighlighterRightThumbstick; // 0x308(0x08)
	struct UImage* StadiaButtonHighlighterDpadDown; // 0x310(0x08)
	struct UImage* StadiaButtonHighlighterDpadLeft; // 0x318(0x08)
	struct UImage* StadiaButtonHighlighterDpadRight; // 0x320(0x08)
	struct UImage* StadiaButtonHighlighterDpadUp; // 0x328(0x08)
	struct UImage* StadiaButtonHighlighterFaceButtonBottom; // 0x330(0x08)
	struct UImage* StadiaButtonHighlighterFaceButtonLeft; // 0x338(0x08)
	struct UImage* StadiaButtonHighlighterFaceButtonRight; // 0x340(0x08)
	struct UImage* StadiaButtonHighlighterFaceButtonTop; // 0x348(0x08)
	struct UImage* StadiaButtonHighlighterLeftShoulder; // 0x350(0x08)
	struct UImage* StadiaButtonHighlighterLeftThumbstick; // 0x358(0x08)
	struct UImage* StadiaButtonHighlighterMenuButton; // 0x360(0x08)
	struct UImage* StadiaButtonHighlighterOptionsButton; // 0x368(0x08)
	struct UImage* StadiaButtonHighlighterRightShoulder; // 0x370(0x08)
	struct UImage* StadiaButtonHighlighterRightThumbstick; // 0x378(0x08)
	struct UCanvasPanel* StadiaGamepad; // 0x380(0x08)
	struct UImage* SwitchButtonHighlighterDpadDown; // 0x388(0x08)
	struct UImage* SwitchButtonHighlighterDpadLeft; // 0x390(0x08)
	struct UImage* SwitchButtonHighlighterDpadRight; // 0x398(0x08)
	struct UImage* SwitchButtonHighlighterDpadUp; // 0x3a0(0x08)
	struct UImage* SwitchButtonHighlighterFaceButtonBottom; // 0x3a8(0x08)
	struct UImage* SwitchButtonHighlighterFaceButtonLeft; // 0x3b0(0x08)
	struct UImage* SwitchButtonHighlighterFaceButtonRight; // 0x3b8(0x08)
	struct UImage* SwitchButtonHighlighterFaceButtonTop; // 0x3c0(0x08)
	struct UImage* SwitchButtonHighlighterLeftShoulder; // 0x3c8(0x08)
	struct UImage* SwitchButtonHighlighterLeftThumbstick; // 0x3d0(0x08)
	struct UImage* SwitchButtonHighlighterMenuButton; // 0x3d8(0x08)
	struct UImage* SwitchButtonHighlighterOptionsButton; // 0x3e0(0x08)
	struct UImage* SwitchButtonHighlighterRightShoulder; // 0x3e8(0x08)
	struct UImage* SwitchButtonHighlighterRightThumbstick; // 0x3f0(0x08)
	struct UCanvasPanel* SwitchGamepad; // 0x3f8(0x08)
	struct UImage* XboxButtonHighlighterDpadDown_2; // 0x400(0x08)
	struct UImage* XboxButtonHighlighterDpadLeft_2; // 0x408(0x08)
	struct UImage* XboxButtonHighlighterDpadRight_2; // 0x410(0x08)
	struct UImage* XboxButtonHighlighterDpadUp_2; // 0x418(0x08)
	struct UImage* XboxButtonHighlighterFaceButtonBottom_2; // 0x420(0x08)
	struct UImage* XboxButtonHighlighterFaceButtonLeft_2; // 0x428(0x08)
	struct UImage* XboxButtonHighlighterFaceButtonRight_2; // 0x430(0x08)
	struct UImage* XboxButtonHighlighterFaceButtonTop_2; // 0x438(0x08)
	struct UImage* XboxButtonHighlighterLeftShoulder_2; // 0x440(0x08)
	struct UImage* XboxButtonHighlighterLeftThumbstick_2; // 0x448(0x08)
	struct UImage* XboxButtonHighlighterMenuButton_2; // 0x450(0x08)
	struct UImage* XboxButtonHighlighterOptionsButton_2; // 0x458(0x08)
	struct UImage* XboxButtonHighlighterRightShoulder_2; // 0x460(0x08)
	struct UImage* XboxButtonHighlighterRightThumbstick_2; // 0x468(0x08)
	struct UCanvasPanel* XboxGamepad; // 0x470(0x08)
	struct TMap<struct FKey, struct UWidget*> ButtonMapStadia; // 0x478(0x50)
	struct UWidget* HighlightedButton; // 0x4c8(0x08)
	struct TMap<struct FKey, struct UWidget*> ButtonMapXbox; // 0x4d0(0x50)
	struct TMap<struct FKey, struct UWidget*> ActiveButtonMap; // 0x520(0x50)
	struct TMap<struct FKey, struct UWidget*> ButtonMapPs; // 0x570(0x50)
	struct TMap<struct FKey, struct UWidget*> ButtonMapSwitch; // 0x5c0(0x50)

	void InitButtonsSwitch(); // Function WBP_GamepadBindings.WBP_GamepadBindings_C.InitButtonsSwitch // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void InitButtonsPs(); // Function WBP_GamepadBindings.WBP_GamepadBindings_C.InitButtonsPs // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void InitButtonsXbox(); // Function WBP_GamepadBindings.WBP_GamepadBindings_C.InitButtonsXbox // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void InitButtonsStadia(); // Function WBP_GamepadBindings.WBP_GamepadBindings_C.InitButtonsStadia // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void OnChordCaptured(struct FInputChord CapturedChord); // Function WBP_GamepadBindings.WBP_GamepadBindings_C.OnChordCaptured // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void BindOnChordCaptured(struct UBindCapturePrompt* Prompt); // Function WBP_GamepadBindings.WBP_GamepadBindings_C.BindOnChordCaptured // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void Construct(); // Function WBP_GamepadBindings.WBP_GamepadBindings_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x13c4ca0
	void HighlightButton(); // Function WBP_GamepadBindings.WBP_GamepadBindings_C.HighlightButton // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void ControllerConnectionChanged(); // Function WBP_GamepadBindings.WBP_GamepadBindings_C.ControllerConnectionChanged // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void ExecuteUbergraph_WBP_GamepadBindings(int32_t EntryPoint); // Function WBP_GamepadBindings.WBP_GamepadBindings_C.ExecuteUbergraph_WBP_GamepadBindings // (Final|UbergraphFunction|HasDefaults) // @ game+0x13c4ca0
};

