// WidgetBlueprintGeneratedClass WBP_Corporations_Slideshow.WBP_Corporations_Slideshow_C
// Size: 0x351 (Inherited: 0x260)
struct UWBP_Corporations_Slideshow_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UWidgetAnimation* Mash_Slideshow; // 0x268(0x08)
	struct UWidgetAnimation* NWF_Slideshow; // 0x270(0x08)
	struct UWidgetAnimation* Farmira_Slideshow; // 0x278(0x08)
	struct UWidgetSwitcher* Corporation; // 0x280(0x08)
	struct UOverlay* Farmira; // 0x288(0x08)
	struct UImage* Img; // 0x290(0x08)
	struct UImage* Img_2; // 0x298(0x08)
	struct UImage* Img_3; // 0x2a0(0x08)
	struct UImage* Img_4; // 0x2a8(0x08)
	struct UImage* Img_5; // 0x2b0(0x08)
	struct UImage* Img_6; // 0x2b8(0x08)
	struct UImage* Img_7; // 0x2c0(0x08)
	struct UImage* Img_8; // 0x2c8(0x08)
	struct UImage* Img_9; // 0x2d0(0x08)
	struct UImage* Img_10; // 0x2d8(0x08)
	struct UImage* Img_11; // 0x2e0(0x08)
	struct UImage* Img_12; // 0x2e8(0x08)
	struct UImage* Img_13; // 0x2f0(0x08)
	struct UImage* Img_14; // 0x2f8(0x08)
	struct UImage* Img_15; // 0x300(0x08)
	struct UImage* Img_16; // 0x308(0x08)
	struct UImage* Img_17; // 0x310(0x08)
	struct UImage* Img_18; // 0x318(0x08)
	struct UImage* Img_19; // 0x320(0x08)
	struct UImage* Img_20; // 0x328(0x08)
	struct UImage* LeftFader; // 0x330(0x08)
	struct UOverlay* Mash; // 0x338(0x08)
	struct UOverlay* NWF; // 0x340(0x08)
	struct UImage* TopFader; // 0x348(0x08)
	enum class EHWFaction CorporationInput; // 0x350(0x01)

	void Play(); // Function WBP_Corporations_Slideshow.WBP_Corporations_Slideshow_C.Play // (BlueprintCallable|BlueprintEvent) // @ game+0x13c4ca0
	void ExecuteUbergraph_WBP_Corporations_Slideshow(int32_t EntryPoint); // Function WBP_Corporations_Slideshow.WBP_Corporations_Slideshow_C.ExecuteUbergraph_WBP_Corporations_Slideshow // (Final|UbergraphFunction) // @ game+0x13c4ca0
};

