// WidgetBlueprintGeneratedClass WBP_RoundResults2_Missions.WBP_RoundResults2_Missions_C
// Size: 0x2b0 (Inherited: 0x260)
struct UWBP_RoundResults2_Missions_C : UUserWidget {
	struct UProgressBar* FamiliarityProgressBar_2; // 0x260(0x08)
	struct UImage* Image_94; // 0x268(0x08)
	struct UImage* StarIcon_4; // 0x270(0x08)
	struct UImage* StarIcon_5; // 0x278(0x08)
	struct UImage* StarIcon_6; // 0x280(0x08)
	struct UWBP_Box_C* WBP_Box; // 0x288(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel; // 0x290(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel_2; // 0x298(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel_128; // 0x2a0(0x08)
	struct UWBP_RichTextLabel_C* WBP_RichTextLabel_525; // 0x2a8(0x08)
};

